ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/SVD/MDR1986VK01/MDR1986VK01.svd
<?xml version='1.0' encoding='utf-8' standalone='no'?>
<device schemaVersion="1.1"
    xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_1.xsd">
    <name>MDR1986VK01</name>
    <version>1.0.2</version>
    <description>MDR1986VK01</description>
    <addressUnitBits>8</addressUnitBits>
    <width>32</width>
    <size>0x20</size>
    <peripherals>
        <!--MDR_DMA-->
        <peripheral>
            <name>MDR_DMA</name>
            <description>MDR_DMA description</description>
            <groupName>MDR_DMA</groupName>
            <baseAddress>0xE0042000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>STATUS</name>
                    <displayName>STATUS</displayName>
                    <description>STATUS description</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>CONFIG</name>
                    <displayName>CONFIG</displayName>
                    <description>CONFIG description</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>CTRL_BASE_PTR</name>
                    <displayName>CTRL_BASE_PTR</displayName>
                    <description>CTRL_BASE_PTR description</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ALT_CTRL_BASE_PTR</name>
                    <displayName>ALT_CTRL_BASE_PTR</displayName>
                    <description>ALT_CTRL_BASE_PTR description</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>WAITONREG_STATUS</name>
                    <displayName>WAITONREG_STATUS</displayName>
                    <description>WAITONREG_STATUS description</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>CHNL_SW_REQUEST</name>
                    <displayName>CHNL_SW_REQUEST</displayName>
                    <description>CHNL_SW_REQUEST description</description>
                    <addressOffset>0x00000014</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>CHNL_USEBURST_SET</name>
                    <displayName>CHNL_USEBURST_SET</displayName>
                    <description>CHNL_USEBURST_SET description</description>
                    <addressOffset>0x00000018</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>CHNL_USEBURST_CLR</name>
                    <displayName>CHNL_USEBURST_CLR</displayName>
                    <description>CHNL_USEBURST_CLR description</description>
                    <addressOffset>0x0000001C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>CHNL_REQ_MASK_SET</name>
                    <displayName>CHNL_REQ_MASK_SET</displayName>
                    <description>CHNL_REQ_MASK_SET description</description>
                    <addressOffset>0x00000020</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>CHNL_REQ_MASK_CLR</name>
                    <displayName>CHNL_REQ_MASK_CLR</displayName>
                    <description>CHNL_REQ_MASK_CLR description</description>
                    <addressOffset>0x00000024</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>CHNL_ENABLE_SET</name>
                    <displayName>CHNL_ENABLE_SET</displayName>
                    <description>CHNL_ENABLE_SET description</description>
                    <addressOffset>0x00000028</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>CHNL_ENABLE_CLR</name>
                    <displayName>CHNL_ENABLE_CLR</displayName>
                    <description>CHNL_ENABLE_CLR description</description>
                    <addressOffset>0x0000002C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>CHNL_PRI_ALT_SET</name>
                    <displayName>CHNL_PRI_ALT_SET</displayName>
                    <description>CHNL_PRI_ALT_SET description</description>
                    <addressOffset>0x00000030</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>CHNL_PRI_ALT_CLR</name>
                    <displayName>CHNL_PRI_ALT_CLR</displayName>
                    <description>CHNL_PRI_ALT_CLR description</description>
                    <addressOffset>0x00000034</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>CHNL_PRIORITY_SET</name>
                    <displayName>CHNL_PRIORITY_SET</displayName>
                    <description>CHNL_PRIORITY_SET description</description>
                    <addressOffset>0x00000038</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>CHNL_PRIORITY_CLR</name>
                    <displayName>CHNL_PRIORITY_CLR</displayName>
                    <description>CHNL_PRIORITY_CLR description</description>
                    <addressOffset>0x0000003C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ERR_CLR</name>
                    <displayName>ERR_CLR</displayName>
                    <description>ERR_CLR description</description>
                    <addressOffset>0x0000004C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>CHMUX0</name>
                    <displayName>CHMUX0</displayName>
                    <description>CHMUX0 description</description>
                    <addressOffset>0x00000050</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>CHMUX1</name>
                    <displayName>CHMUX1</displayName>
                    <description>CHMUX1 description</description>
                    <addressOffset>0x00000054</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>CHMUX2</name>
                    <displayName>CHMUX2</displayName>
                    <description>CHMUX2 description</description>
                    <addressOffset>0x00000058</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>CHMUX3</name>
                    <displayName>CHMUX3</displayName>
                    <description>CHMUX3 description</description>
                    <addressOffset>0x0000005C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>CHMUX4</name>
                    <displayName>CHMUX4</displayName>
                    <description>CHMUX4 description</description>
                    <addressOffset>0x00000060</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>CHMUX5</name>
                    <displayName>CHMUX5</displayName>
                    <description>CHMUX5 description</description>
                    <addressOffset>0x00000064</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>CHMUX6</name>
                    <displayName>CHMUX6</displayName>
                    <description>CHMUX6 description</description>
                    <addressOffset>0x00000068</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>CHMUX7</name>
                    <displayName>CHMUX7</displayName>
                    <description>CHMUX7 description</description>
                    <addressOffset>0x0000006C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
