ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/SVD/MDR1986VK01/MDR1986VK01.svd
            </registers>
        </peripheral>
        <!--MDR_ICACHE-->
        <peripheral>
            <name>MDR_ICACHE</name>
            <description>MDR_ICACHE description</description>
            <groupName>MDR_CACHE</groupName>
            <baseAddress>0xE0044000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>KEY</name>
                    <displayName>KEY</displayName>
                    <description>KEY description</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>CNTL</name>
                    <displayName>CNTL</displayName>
                    <description>CNTL description</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>HIT_CNT</name>
                    <displayName>HIT_CNT</displayName>
                    <description>HIT_CNT description</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>MISS_CNT</name>
                    <displayName>MISS_CNT</displayName>
                    <description>MISS_CNT description</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ECC_CNTL</name>
                    <displayName>ECC_CNTL</displayName>
                    <description>ECC_CNTL description</description>
                    <addressOffset>0x00000020</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ECC_ADDR</name>
                    <displayName>ECC_ADDR</displayName>
                    <description>ECC_ADDR description</description>
                    <addressOffset>0x00000024</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ECC_DATA</name>
                    <displayName>ECC_DATA</displayName>
                    <description>ECC_DATA description</description>
                    <addressOffset>0x00000028</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ECC_ECC</name>
                    <displayName>ECC_ECC</displayName>
                    <description>ECC_ECC description</description>
                    <addressOffset>0x0000002C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
            </registers>
        </peripheral>
        <!--MDR_DCACHE-->
        <peripheral>
            <name>MDR_DCACHE</name>
            <description>MDR_DCACHE description</description>
            <groupName>MDR_CACHE</groupName>
            <baseAddress>0xE0045000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>KEY</name>
                    <displayName>KEY</displayName>
                    <description>KEY description</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>CNTL</name>
                    <displayName>CNTL</displayName>
                    <description>CNTL description</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>HIT_CNT</name>
                    <displayName>HIT_CNT</displayName>
                    <description>HIT_CNT description</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>MISS_CNT</name>
                    <displayName>MISS_CNT</displayName>
                    <description>MISS_CNT description</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ECC_CNTL</name>
                    <displayName>ECC_CNTL</displayName>
                    <description>ECC_CNTL description</description>
                    <addressOffset>0x00000020</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ECC_ADDR</name>
                    <displayName>ECC_ADDR</displayName>
                    <description>ECC_ADDR description</description>
                    <addressOffset>0x00000024</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ECC_DATA</name>
                    <displayName>ECC_DATA</displayName>
                    <description>ECC_DATA description</description>
                    <addressOffset>0x00000028</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ECC_ECC</name>
                    <displayName>ECC_ECC</displayName>
                    <description>ECC_ECC description</description>
                    <addressOffset>0x0000002C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
