ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/SVD/MDR1986VK01/MDR1986VK01.svd
            </registers>
        </peripheral>
        <!--MDR_SCR-->
        <peripheral>
            <name>MDR_SCR</name>
            <description>MDR_SCR description</description>
            <groupName>MDR_SCR</groupName>
            <baseAddress>0xE0043000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <!--CNTRL-->
                <register>
                    <name>CNTRL</name>
                    <description>CNTRL description</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>SCR_EN</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SCR_MODE</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SCR_FINISH_IE</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SCR_ERROR_IE</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SCR_SEC</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SCR_CYCLE</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SCR_TIME</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>SCR_FINISH_IF</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SCR_ERROR_IF</name>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SCR_DREADY</name>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <!--S_ADDR-->
                <register>
                    <name>S_ADDR</name>
                    <description>S_ADDR description</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <!--F_ADDR-->
                <register>
                    <name>F_ADDR</name>
                    <description>F_ADDR description</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <!--DATA-->
                <register>
                    <name>DATA</name>
                    <description>DATA description</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <!--ECC-->
                <register>
                    <name>ECC</name>
                    <description>ECC description</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>ECC</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <!--MDR_ETH-->
        <peripheral>
            <name>MDR_ETH</name>
            <description>MDR_ETH description</description>
            <groupName>MDR_ETH</groupName>
            <baseAddress>0x21000000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>DILIMETR</name>
                    <displayName>DILIMETR</displayName>
                    <description>DILIMETR description</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>MAC_T</name>
                    <displayName>MAC_T</displayName>
                    <description>MAC_T description</description>
                    <addressOffset>0x00000002</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>MAC5</name>
                            <description>MAC5 description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>MAC4</name>
                            <description>MAC4 description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MAC_M</name>
                    <displayName>MAC_M</displayName>
                    <description>MAC_M description</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>MAC3</name>
                            <description>MAC3 description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>MAC2</name>
                            <description>MAC2 description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MAC_H</name>
                    <displayName>MAC_H</displayName>
                    <description>MAC_H description</description>
                    <addressOffset>0x00000006</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>MAC1</name>
                            <description>MAC1 description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>MAC0</name>
                            <description>MAC0 description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HASH0</name>
                    <displayName>HASH0</displayName>
                    <description>HASH0 description</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>HASH1</name>
                    <displayName>HASH1</displayName>
                    <description>HASH1 description</description>
                    <addressOffset>0x0000000A</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>HASH2</name>
                    <displayName>HASH2</displayName>
                    <description>HASH2 description</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>HASH3</name>
                    <displayName>HASH3</displayName>
                    <description>HASH3 description</description>
                    <addressOffset>0x0000000E</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ETH_IPG</name>
                    <displayName>ETH_IPG</displayName>
                    <description>ETH_IPG description</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ETH_PSC</name>
                    <displayName>ETH_PSC</displayName>
                    <description>ETH_PSC description</description>
                    <addressOffset>0x00000012</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ETH_BAG</name>
                    <displayName>ETH_BAG</displayName>
                    <description>ETH_BAG description</description>
                    <addressOffset>0x00000014</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>JITTERWND</name>
                    <displayName>JITTERWND</displayName>
                    <description>JITTERWND description</description>
                    <addressOffset>0x00000016</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>R_CFG</name>
                    <displayName>R_CFG</displayName>
                    <description>R_CFG description</description>
                    <addressOffset>0x00000018</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>MCA_EN</name>
                            <description>MCA_EN description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BCA_EN</name>
                            <description>BCA_EN description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UCA_EN</name>
                            <description>UCA_EN description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>AC_EN</name>
                            <description>AC_EN description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EF_EN</name>
                            <description>EF_EN description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CF_EN</name>
                            <description>CF_EN description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LF_EN</name>
                            <description>LF_EN description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SF_EN</name>
                            <description>SF_EN description</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EVNT_MODE</name>
                            <description>EVNT_MODE description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>MSB1ST</name>
                            <description>MSB1ST description</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BE</name>
                            <description>BE description</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EN</name>
                            <description>EN description</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>X_CFG</name>
                    <displayName>X_CFG</displayName>
                    <description>X_CFG description</description>
                    <addressOffset>0x0000001A</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>RTRY_CNT</name>
                            <description>RTRY_CNT description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>IPG_EN</name>
                            <description>IPG_EN description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CRC_EN</name>
                            <description>CRC_EN description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PRE_EN</name>
                            <description>PRE_EN description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PAD_EN</name>
                            <description>PAD_EN description</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EVNT_MODE</name>
                            <description>EVNT_MODE description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>MSB1ST</name>
                            <description>MSB1ST description</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BE</name>
                            <description>BE description</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EN</name>
                            <description>EN description</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>G_CFG</name>
                    <displayName>G_CFG</displayName>
                    <description>G_CFG description</description>
                    <addressOffset>0x0000001C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>COLWND</name>
                            <description>COLWND description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>PAUSE_EN</name>
                            <description>PAUSE_EN description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DTRM_EN</name>
                            <description>DTRM_EN description</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HD_EN</name>
                            <description>HD_EN description</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EXT_EN</name>
                            <description>EXT_EN description</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BUFF_MODE</name>
                            <description>BUFF_MODE description</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>RCLR_EN</name>
                            <description>RCLR_EN description</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>XRST</name>
                            <description>XRST description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RRST</name>
                            <description>RRST description</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DLB</name>
                            <description>DLB description</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMII_NMII</name>
                            <description>RMII_NMII description</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMII_SPEED</name>
                            <description>RMII_SPEED description</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DBGRF_EN</name>
                            <description>DBGRF_EN description</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DBGXF_EN</name>
                            <description>DBGXF_EN description</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DBG_MODE</name>
                            <description>DBG_MODE description</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
