ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/SVD/MDR1986VK01/MDR1986VK01.svd
                <register>
                    <name>IMR</name>
                    <displayName>IMR</displayName>
                    <description>IMR description</description>
                    <addressOffset>0x00000020</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>RF_OK</name>
                            <description>RF_OK description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MISSED_F</name>
                            <description>MISSED_F description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OVF</name>
                            <description>OVF description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SMB_ERR</name>
                            <description>SMB_ERR description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CRC_ERR</name>
                            <description>CRC_ERR description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CF</name>
                            <description>CF description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LF</name>
                            <description>LF description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SF</name>
                            <description>SF description</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>XF_OK</name>
                            <description>XF_OK description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>XF_ERR</name>
                            <description>XF_ERR description</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UNDF</name>
                            <description>UNDF description</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LC</name>
                            <description>LC description</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CRS_LOST</name>
                            <description>CRS_LOST description</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MDIO_INT</name>
                            <description>MDIO_INT description</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MII_RDY</name>
                            <description>MII_RDY description</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IFR</name>
                    <displayName>IFR</displayName>
                    <description>IFR description</description>
                    <addressOffset>0x00000022</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>RF_OK</name>
                            <description>RF_OK description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MISSED_F</name>
                            <description>MISSED_F description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OVF</name>
                            <description>OVF description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SMB_ERR</name>
                            <description>SMB_ERR description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CRC_ERR</name>
                            <description>CRC_ERR description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CF</name>
                            <description>CF description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LF</name>
                            <description>LF description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SF</name>
                            <description>SF description</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>XF_OK</name>
                            <description>XF_OK description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>XF_ERR</name>
                            <description>XF_ERR description</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UNDF</name>
                            <description>UNDF description</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LC</name>
                            <description>LC description</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CRS_LOST</name>
                            <description>CRS_LOST description</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MDIO_INT</name>
                            <description>MDIO_INT description</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MII_RDY</name>
                            <description>MII_RDY description</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MDIO_CTRL</name>
                    <displayName>MDIO_CTRL</displayName>
                    <description>MDIO_CTRL description</description>
                    <addressOffset>0x00000024</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>RG_A</name>
                            <description>RG_A description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>DIV</name>
                            <description>DIV description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>PHY_A</name>
                            <description>PHY_A description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>OP</name>
                            <description>OP description</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PRE_EN</name>
                            <description>PRE_EN description</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RDY</name>
                            <description>RDY description</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MDIO_DATA</name>
                    <displayName>MDIO_DATA</displayName>
                    <description>MDIO_DATA description</description>
                    <addressOffset>0x00000026</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>R_HEAD</name>
                    <displayName>R_HEAD</displayName>
                    <description>R_HEAD description</description>
                    <addressOffset>0x00000028</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>X_TAIL</name>
                    <displayName>X_TAIL</displayName>
                    <description>X_TAIL description</description>
                    <addressOffset>0x0000002A</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>R_TAIL</name>
                    <displayName>R_TAIL</displayName>
                    <description>R_TAIL description</description>
                    <addressOffset>0x0000002C</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>X_HEAD</name>
                    <displayName>X_HEAD</displayName>
                    <description>X_HEAD description</description>
                    <addressOffset>0x0000002E</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>STAT</name>
                    <displayName>STAT</displayName>
                    <description>STAT description</description>
                    <addressOffset>0x00000030</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>R_EMPTY</name>
                            <description>R_EMPTY description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>R_AEMPTY</name>
                            <description>R_AEMPTY description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>R_HALF</name>
                            <description>R_HALF description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>R_AFULL</name>
                            <description>R_AFULL description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>R_FULL</name>
                            <description>R_FULL description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>R_COUNT</name>
                            <description>R_COUNT description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>X_EMPTY</name>
                            <description>X_EMPTY description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>X_AEMPTY</name>
                            <description>X_AEMPTY description</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>X_HALF</name>
                            <description>X_HALF description</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>X_AFULL</name>
                            <description>X_AFULL description</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>X_FULL</name>
                            <description>X_FULL description</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RCOUNTER</name>
                    <displayName>RCOUNTER</displayName>
                    <description>RCOUNTER description</description>
                    <addressOffset>0x00000032</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>PHY_CONTROL</name>
                    <displayName>PHY_CONTROL</displayName>
                    <description>PHY_CONTROL description</description>
                    <addressOffset>0x00000034</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>PHY_STATUS</name>
                    <displayName>PHY_STATUS</displayName>
                    <description>PHY_STATUS description</description>
                    <addressOffset>0x00000036</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>PHY_CNTR_A</name>
                    <displayName>PHY_CNTR_A</displayName>
                    <description>PHY_CNTR_A description</description>
                    <addressOffset>0x00000038</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <fields/>
                </register>
