ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/SVD/MDR1986VK01/MDR1986VK01.svd
            </registers>
        </peripheral>
        <!--MDR_USB-->
        <peripheral>
            <name>MDR_USB</name>
            <description>MDR_USB description</description>
            <groupName>MDR_USB</groupName>
            <baseAddress>0x21010000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>FADDR</name>
                    <displayName>FADDR</displayName>
                    <description>FADDR description</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x8</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>FADDR</name>
                            <description>FADDR description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>USB_POWER</name>
                    <displayName>USB_POWER</displayName>
                    <description>USB_POWER description</description>
                    <addressOffset>0x00000001</addressOffset>
                    <size>0x8</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>EN_SUSPENDM</name>
                            <description>EN_SUSPENDM description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SUSPENDMODE</name>
                            <description>SUSPENDMODE description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RESUME</name>
                            <description>RESUME description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RESET</name>
                            <description>RESET description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HS_MODE</name>
                            <description>HS_MODE description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HS_EN</name>
                            <description>HS_EN description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SOFT_CONN</name>
                            <description>SOFT_CONN description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ISO_UPDATE</name>
                            <description>ISO_UPDATE description</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTRTX</name>
                    <displayName>INTRTX</displayName>
                    <description>INTRTX description</description>
                    <addressOffset>0x00000002</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>EP0</name>
                            <description>EP0 description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP1_TX</name>
                            <description>EP1_TX description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP2_TX</name>
                            <description>EP2_TX description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP3_TX</name>
                            <description>EP3_TX description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP4_TX</name>
                            <description>EP4_TX description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP5_TX</name>
                            <description>EP5_TX description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP6_TX</name>
                            <description>EP6_TX description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP7_TX</name>
                            <description>EP7_TX description</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP8_TX</name>
                            <description>EP8_TX description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP9_TX</name>
                            <description>EP9_TX description</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP10_TX</name>
                            <description>EP10_TX description</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP11_TX</name>
                            <description>EP11_TX description</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP12_TX</name>
                            <description>EP12_TX description</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP13_TX</name>
                            <description>EP13_TX description</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP14_TX</name>
                            <description>EP14_TX description</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP15_TX</name>
                            <description>EP15_TX description</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTRRX</name>
                    <displayName>INTRRX</displayName>
                    <description>INTRRX description</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>EP1_RX</name>
                            <description>EP1_RX description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP2_RX</name>
                            <description>EP2_RX description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP3_RX</name>
                            <description>EP3_RX description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP4_RX</name>
                            <description>EP4_RX description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP5_RX</name>
                            <description>EP5_RX description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP6_RX</name>
                            <description>EP6_RX description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP7_RX</name>
                            <description>EP7_RX description</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP8_RX</name>
                            <description>EP8_RX description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP9_RX</name>
                            <description>EP9_RX description</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP10_RX</name>
                            <description>EP10_RX description</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP11_RX</name>
                            <description>EP11_RX description</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP12_RX</name>
                            <description>EP12_RX description</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP13_RX</name>
                            <description>EP13_RX description</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP14_RX</name>
                            <description>EP14_RX description</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP15_RX</name>
                            <description>EP15_RX description</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTRTXE</name>
                    <displayName>INTRTXE</displayName>
                    <description>INTRTXE description</description>
                    <addressOffset>0x00000006</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>EP0</name>
                            <description>EP0 description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP1_TX</name>
                            <description>EP1_TX description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP2_TX</name>
                            <description>EP2_TX description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP3_TX</name>
                            <description>EP3_TX description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP4_TX</name>
                            <description>EP4_TX description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP5_TX</name>
                            <description>EP5_TX description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP6_TX</name>
                            <description>EP6_TX description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP7_TX</name>
                            <description>EP7_TX description</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP8_TX</name>
                            <description>EP8_TX description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP9_TX</name>
                            <description>EP9_TX description</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP10_TX</name>
                            <description>EP10_TX description</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP11_TX</name>
                            <description>EP11_TX description</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP12_TX</name>
                            <description>EP12_TX description</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP13_TX</name>
                            <description>EP13_TX description</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP14_TX</name>
                            <description>EP14_TX description</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP15_TX</name>
                            <description>EP15_TX description</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTRRXE</name>
                    <displayName>INTRRXE</displayName>
                    <description>INTRRXE description</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>EP1_RX</name>
                            <description>EP1_RX description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP2_RX</name>
                            <description>EP2_RX description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP3_RX</name>
                            <description>EP3_RX description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP4_RX</name>
                            <description>EP4_RX description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP5_RX</name>
                            <description>EP5_RX description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP6_RX</name>
                            <description>EP6_RX description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP7_RX</name>
                            <description>EP7_RX description</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP8_RX</name>
                            <description>EP8_RX description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP9_RX</name>
                            <description>EP9_RX description</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP10_RX</name>
                            <description>EP10_RX description</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP11_RX</name>
                            <description>EP11_RX description</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP12_RX</name>
                            <description>EP12_RX description</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP13_RX</name>
                            <description>EP13_RX description</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP14_RX</name>
                            <description>EP14_RX description</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP15_RX</name>
                            <description>EP15_RX description</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
