ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/SVD/MDR1986VK01/MDR1986VK01.svd
                <register>
                    <name>INTRUSB</name>
                    <displayName>INTRUSB</displayName>
                    <description>INTRUSB description</description>
                    <addressOffset>0x0000000A</addressOffset>
                    <size>0x8</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>SUSPEND</name>
                            <description>SUSPEND description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RESUME</name>
                            <description>RESUME description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RESET_BABBLE</name>
                            <description>RESET_BABBLE description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SOF</name>
                            <description>SOF description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CONN</name>
                            <description>CONN description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DISCONN</name>
                            <description>DISCONN description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SESS_REQ</name>
                            <description>SESS_REQ description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>VBUS_ERR</name>
                            <description>VBUS_ERR description</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTRUSBE</name>
                    <displayName>INTRUSBE</displayName>
                    <description>INTRUSBE description</description>
                    <addressOffset>0x0000000B</addressOffset>
                    <size>0x8</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>SUSPEND</name>
                            <description>SUSPEND description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RESUME</name>
                            <description>RESUME description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RESET_BABBLE</name>
                            <description>RESET_BABBLE description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SOF</name>
                            <description>SOF description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CONN</name>
                            <description>CONN description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DISCONN</name>
                            <description>DISCONN description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SESS_REQ</name>
                            <description>SESS_REQ description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>VBUS_ERR</name>
                            <description>VBUS_ERR description</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FRAME</name>
                    <displayName>FRAME</displayName>
                    <description>FRAME description</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>FRAME</name>
                            <description>FRAME description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INDEX</name>
                    <displayName>INDEX</displayName>
                    <description>INDEX description</description>
                    <addressOffset>0x0000000E</addressOffset>
                    <size>0x8</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>INDEX</name>
                            <description>INDEX description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TESTMODE</name>
                    <displayName>TESTMODE</displayName>
                    <description>TESTMODE description</description>
                    <addressOffset>0x0000000F</addressOffset>
                    <size>0x8</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>TEST_SE0_NAK</name>
                            <description>TEST_SE0_NAK description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TEST_J</name>
                            <description>TEST_J description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TEST_K</name>
                            <description>TEST_K description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TEST_PACKET</name>
                            <description>TEST_PACKET description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FORCE_HS</name>
                            <description>FORCE_HS description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FORSE_FS</name>
                            <description>FORSE_FS description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FIFO_ACCESS</name>
                            <description>FIFO_ACCESS description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FORCE_HOST</name>
                            <description>FORCE_HOST description</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXMAXP</name>
                    <displayName>TXMAXP</displayName>
                    <description>TXMAXP description</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>TXMAXP</name>
                            <description>TXMAXP description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CSR0_TXCSR</name>
                    <displayName>CSR0_TXCSR</displayName>
                    <description>CSR0_TXCSR description</description>
                    <addressOffset>0x00000012</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RXMAXP</name>
                    <displayName>RXMAXP</displayName>
                    <description>RXMAXP description</description>
                    <addressOffset>0x00000014</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>RXMAXP</name>
                            <description>RXMAXP description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXCSR</name>
                    <displayName>RXCSR</displayName>
                    <description>RXCSR description</description>
                    <addressOffset>0x00000016</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>COUNT0_RXCOUNT</name>
                    <displayName>COUNT0_RXCOUNT</displayName>
                    <description>COUNT0_RXCOUNT description</description>
                    <addressOffset>0x00000018</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TYPE0_TXTYPE</name>
                    <displayName>TYPE0_TXTYPE</displayName>
                    <description>TYPE0_TXTYPE description</description>
                    <addressOffset>0x0000001A</addressOffset>
                    <size>0x8</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>ENDPOINT</name>
                            <description>ENDPOINT description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>PROTOCOL</name>
                            <description>PROTOCOL description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>NAKLIMIT0_TXINTERVAL</name>
                    <displayName>NAKLIMIT0_TXINTERVAL</displayName>
                    <description>NAKLIMIT0_TXINTERVAL description</description>
                    <addressOffset>0x0000001B</addressOffset>
                    <size>0x8</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RXTYPE</name>
                    <displayName>RXTYPE</displayName>
                    <description>RXTYPE description</description>
                    <addressOffset>0x0000001C</addressOffset>
                    <size>0x8</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>ENDPOINT</name>
                            <description>ENDPOINT description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>PROTOCOL</name>
                            <description>PROTOCOL description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXINTERVAL</name>
                    <displayName>RXINTERVAL</displayName>
                    <description>RXINTERVAL description</description>
                    <addressOffset>0x0000001D</addressOffset>
                    <size>0x8</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>CONFIGDATA_FIFOSIZE</name>
                    <displayName>CONFIGDATA_FIFOSIZE</displayName>
                    <description>CONFIGDATA_FIFOSIZE description</description>
                    <addressOffset>0x0000001F</addressOffset>
                    <size>0x8</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>FIFO0</name>
                    <displayName>FIFO0</displayName>
                    <description>FIFO0 description</description>
                    <addressOffset>0x00000020</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>FIFO1</name>
                    <displayName>FIFO1</displayName>
                    <description>FIFO1 description</description>
                    <addressOffset>0x00000024</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>FIFO2</name>
                    <displayName>FIFO2</displayName>
                    <description>FIFO2 description</description>
                    <addressOffset>0x00000028</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>FIFO3</name>
                    <displayName>FIFO3</displayName>
                    <description>FIFO3 description</description>
                    <addressOffset>0x0000002C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>DEVCTL</name>
                    <displayName>DEVCTL</displayName>
                    <description>DEVCTL description</description>
                    <addressOffset>0x00000060</addressOffset>
                    <size>0x8</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>SESSION</name>
                            <description>SESSION description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_REQ</name>
                            <description>HOST_REQ description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_MODE</name>
                            <description>HOST_MODE description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>VBUS0</name>
                            <description>VBUS0 description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>VBUS1</name>
                            <description>VBUS1 description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LSDEV</name>
                            <description>LSDEV description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FSDEV</name>
                            <description>FSDEV description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>B_DEVICE</name>
                            <description>B_DEVICE description</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXFIFOSZ</name>
                    <displayName>TXFIFOSZ</displayName>
                    <description>TXFIFOSZ description</description>
                    <addressOffset>0x00000062</addressOffset>
                    <size>0x8</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>SIZE</name>
                            <description>SIZE description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DPB</name>
                            <description>DPB description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXFIFOSZ</name>
                    <displayName>RXFIFOSZ</displayName>
                    <description>RXFIFOSZ description</description>
                    <addressOffset>0x00000063</addressOffset>
                    <size>0x8</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>SIZE</name>
                            <description>SIZE description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DPB</name>
                            <description>DPB description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXFIFOADD</name>
                    <displayName>TXFIFOADD</displayName>
                    <description>TXFIFOADD description</description>
                    <addressOffset>0x00000064</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RXFIFOADD</name>
                    <displayName>RXFIFOADD</displayName>
                    <description>RXFIFOADD description</description>
                    <addressOffset>0x00000066</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <fields/>
                </register>
