ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/SVD/MDR1986VK01/MDR1986VK01.svd
                <register>
                    <name>HWVERS</name>
                    <displayName>HWVERS</displayName>
                    <description>HWVERS description</description>
                    <addressOffset>0x0000006C</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>YYY</name>
                            <description>YYY description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>XX</name>
                            <description>XX description</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>RC</name>
                            <description>RC description</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <!--MDR_USB_RAM-->
        <peripheral>
            <name>MDR_USB_RAM</name>
            <description>MDR_USB_RAM description</description>
            <groupName>MDR_USB</groupName>
            <baseAddress>0x40093000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>USB_RAM_CNTR</name>
                    <displayName>USB_RAM_CNTR</displayName>
                    <description>USB_RAM_CNTR description</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>USB_M31_CNTR</name>
                    <displayName>USB_M31_CNTR</displayName>
                    <description>USB_M31_CNTR description</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
            </registers>
        </peripheral>
        <!--MDR_USB_TAR0-->
        <peripheral>
            <name>MDR_USB_TAR0</name>
            <description>MDR_USB_TAR0 description</description>
            <groupName>MDR_USB</groupName>
            <baseAddress>0x2101007C</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>TX_FUNC_ADDR_T0</name>
                    <displayName>TX_FUNC_ADDR_T0</displayName>
                    <description>TX_FUNC_ADDR_T0 description</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x8</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TX_HUD_ADDR_T0</name>
                    <displayName>TX_HUD_ADDR_T0</displayName>
                    <description>TX_HUD_ADDR_T0 description</description>
                    <addressOffset>0x00000002</addressOffset>
                    <size>0x8</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TX_HUD_PORT_T0</name>
                    <displayName>TX_HUD_PORT_T0</displayName>
                    <description>TX_HUD_PORT_T0 description</description>
                    <addressOffset>0x00000003</addressOffset>
                    <size>0x8</size>
                    <access>read-write</access>
                    <fields/>
                </register>
            </registers>
        </peripheral>
        <!--MDR_USB_TAR1-->
        <peripheral>
            <name>MDR_USB_TAR1</name>
            <description>MDR_USB_TAR1 description</description>
            <groupName>MDR_USB</groupName>
            <baseAddress>0x21010084</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>TX_FUNC_ADDR_T1</name>
                    <displayName>TX_FUNC_ADDR_T1</displayName>
                    <description>TX_FUNC_ADDR_T1 description</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x8</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TX_HUD_ADDR_T1</name>
                    <displayName>TX_HUD_ADDR_T1</displayName>
                    <description>TX_HUD_ADDR_T1 description</description>
                    <addressOffset>0x00000002</addressOffset>
                    <size>0x8</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TX_HUD_PORT_T1</name>
                    <displayName>TX_HUD_PORT_T1</displayName>
                    <description>TX_HUD_PORT_T1 description</description>
                    <addressOffset>0x00000003</addressOffset>
                    <size>0x8</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RX_FUNC_ADDR_T1</name>
                    <displayName>RX_FUNC_ADDR_T1</displayName>
                    <description>RX_FUNC_ADDR_T1 description</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x8</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RX_HUD_ADDR_T1</name>
                    <displayName>RX_HUD_ADDR_T1</displayName>
                    <description>RX_HUD_ADDR_T1 description</description>
                    <addressOffset>0x00000006</addressOffset>
                    <size>0x8</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RX_HUD_PORT_T1</name>
                    <displayName>RX_HUD_PORT_T1</displayName>
                    <description>RX_HUD_PORT_T1 description</description>
                    <addressOffset>0x00000007</addressOffset>
                    <size>0x8</size>
                    <access>read-write</access>
                    <fields/>
                </register>
