ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/SVD/MDR1986VK01/MDR1986VK01.svd
            </registers>
        </peripheral>
        <!--MDR_USB_TAR2-->
        <peripheral>
            <name>MDR_USB_TAR2</name>
            <description>MDR_USB_TAR2 description</description>
            <groupName>MDR_USB</groupName>
            <baseAddress>0x2101008C</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>TX_FUNC_ADDR_T2</name>
                    <displayName>TX_FUNC_ADDR_T2</displayName>
                    <description>TX_FUNC_ADDR_T2 description</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x8</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TX_HUD_ADDR_T2</name>
                    <displayName>TX_HUD_ADDR_T2</displayName>
                    <description>TX_HUD_ADDR_T2 description</description>
                    <addressOffset>0x00000002</addressOffset>
                    <size>0x8</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TX_HUD_PORT_T2</name>
                    <displayName>TX_HUD_PORT_T2</displayName>
                    <description>TX_HUD_PORT_T2 description</description>
                    <addressOffset>0x00000003</addressOffset>
                    <size>0x8</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RX_FUNC_ADDR_T2</name>
                    <displayName>RX_FUNC_ADDR_T2</displayName>
                    <description>RX_FUNC_ADDR_T2 description</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x8</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RX_HUD_ADDR_T2</name>
                    <displayName>RX_HUD_ADDR_T2</displayName>
                    <description>RX_HUD_ADDR_T2 description</description>
                    <addressOffset>0x00000006</addressOffset>
                    <size>0x8</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RX_HUD_PORT_T2</name>
                    <displayName>RX_HUD_PORT_T2</displayName>
                    <description>RX_HUD_PORT_T2 description</description>
                    <addressOffset>0x00000007</addressOffset>
                    <size>0x8</size>
                    <access>read-write</access>
                    <fields/>
                </register>
            </registers>
        </peripheral>
        <!--MDR_USB_TAR3-->
        <peripheral>
            <name>MDR_USB_TAR3</name>
            <description>MDR_USB_TAR3 description</description>
            <groupName>MDR_USB</groupName>
            <baseAddress>0x21010094</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>TX_FUNC_ADDR_T3</name>
                    <displayName>TX_FUNC_ADDR_T3</displayName>
                    <description>TX_FUNC_ADDR_T3 description</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x8</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TX_HUD_ADDR_T3</name>
                    <displayName>TX_HUD_ADDR_T3</displayName>
                    <description>TX_HUD_ADDR_T3 description</description>
                    <addressOffset>0x00000002</addressOffset>
                    <size>0x8</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TX_HUD_PORT_T3</name>
                    <displayName>TX_HUD_PORT_T3</displayName>
                    <description>TX_HUD_PORT_T3 description</description>
                    <addressOffset>0x00000003</addressOffset>
                    <size>0x8</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RX_FUNC_ADDR_T3</name>
                    <displayName>RX_FUNC_ADDR_T3</displayName>
                    <description>RX_FUNC_ADDR_T3 description</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x8</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RX_HUD_ADDR_T3</name>
                    <displayName>RX_HUD_ADDR_T3</displayName>
                    <description>RX_HUD_ADDR_T3 description</description>
                    <addressOffset>0x00000006</addressOffset>
                    <size>0x8</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RX_HUD_PORT_T3</name>
                    <displayName>RX_HUD_PORT_T3</displayName>
                    <description>RX_HUD_PORT_T3 description</description>
                    <addressOffset>0x00000007</addressOffset>
                    <size>0x8</size>
                    <access>read-write</access>
                    <fields/>
                </register>
            </registers>
        </peripheral>
        <!--MDR_CLK-->
        <peripheral>
            <name>MDR_CLK</name>
            <description>MDR_CLK description</description>
            <groupName>MDR_CLK</groupName>
            <baseAddress>0x40000000</baseAddress>
            <access>read-write</access>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <!--KEY-->
                <register>
                    <name>KEY</name>
                    <description>KEY description</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
