ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/SVD/MDR1986VK01/MDR1986VK01.svd
                <!--MAX_CLK-->
                <register>
                    <name>MAX_CLK</name>
                    <description>MAX_CLK description</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <fields>
                        <field>
                            <name>SELECT</name>
                            <description>SELECT description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>HSI</name>
                                    <description>HSI selected</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HSI/2</name>
                                    <description>HSI/2 selected</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HSE0</name>
                                    <description>HSE0 selected</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HSE0/2</name>
                                    <description>HSE0/2 selected</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HSE1</name>
                                    <description>HSE1 selected</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HSE1/2</name>
                                    <description>HSE1/2 selected</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LSI</name>
                                    <description>LSI selected</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LSE</name>
                                    <description>LSE selected</description>
                                    <value>7</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PLL0</name>
                                    <description>PLL0 selected</description>
                                    <value>8</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PLL1</name>
                                    <description>PLL1 selected</description>
                                    <value>9</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PLL2</name>
                                    <description>PLL2 selected</description>
                                    <value>10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PLL3</name>
                                    <description>PLL3 selected</description>
                                    <value>11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--CPU_CLK-->
                <register>
                    <name>CPU_CLK</name>
                    <description>CPU_CLK description</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x20</size>
                    <fields>
                        <field>
                            <name>DIV</name>
                            <description>DIV description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>EN_CHK_EVENT0</name>
                            <description>EN_CHK_EVENT0 description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EN_CHK_EVENT1</name>
                            <description>EN_CHK_EVENT1 description</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EN_CHK_EVENT2</name>
                            <description>EN_CHK_EVENT2 description</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EN_CHK_EVENT3</name>
                            <description>EN_CHK_EVENT3 description</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EN_CHK</name>
                            <description>EN_CHK description</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CLR_CHK_SHIFT_REG0</name>
                            <description>CLR_CHK_SHIFT_REG0 description</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CLR_CHK_SHIFT_REG1</name>
                            <description>CLR_CHK_SHIFT_REG1 description</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CLR_CHK_EVENT0</name>
                            <description>CLR_CHK_EVENT0 description</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CLR_CHK_EVENT1</name>
                            <description>CLR_CHK_EVENT1 description</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CLR_CHK_EVENT2</name>
                            <description>CLR_CHK_EVENT2 description</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CLR_CHK_EVENT3</name>
                            <description>CLR_CHK_EVENT3 description</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <!--PER0_CLK-->
                <register>
                    <name>PER0_CLK</name>
                    <description>PER0_CLK description</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>0x20</size>
                    <fields>
                        <field>
                            <name>MDR_PORTA</name>
                            <description>MDR_PORTA description</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MDR_PORTB</name>
                            <description>MDR_PORTB description</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MDR_PORTC</name>
                            <description>MDR_PORTC description</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MDR_PORTD</name>
                            <description>MDR_PORTD description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CRC</name>
                            <description>CRC description</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SDIO</name>
                            <description>SDIO description</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SSP0</name>
                            <description>SSP0 description</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SSP1</name>
                            <description>SSP1 description</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CAN0</name>
                            <description>CAN0 description</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CAN1</name>
                            <description>CAN1 description</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UART0</name>
                            <description>UART0 description</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UART1</name>
                            <description>UART1 description</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UART2</name>
                            <description>UART2 description</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UART3</name>
                            <description>UART3 description</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MIL</name>
                            <description>MIL description</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>USB</name>
                            <description>USB description</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <!--PER1_CLK-->
                <register>
                    <name>PER1_CLK</name>
                    <description>PER1_CLK description</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>0x20</size>
                    <fields>
                        <field>
                            <name>TIM0</name>
                            <description>TIM0 description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIM1</name>
                            <description>TIM1 description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIM2</name>
                            <description>TIM2 description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIM3</name>
                            <description>TIM3 description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CAP0</name>
                            <description>CAP0 description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CAP1</name>
                            <description>CAP1 description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CAP2</name>
                            <description>CAP2 description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CAP3</name>
                            <description>CAP3 description</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>QEP0</name>
                            <description>QEP0 description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>QEP1</name>
                            <description>QEP1 description</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PWM0</name>
                            <description>PWM0 description</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PWM1</name>
                            <description>PWM1 description</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PWM2</name>
                            <description>PWM2 description</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PWM3</name>
                            <description>PWM3 description</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PWM4</name>
                            <description>PWM4 description</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PWM5</name>
                            <description>PWM5 description</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PWM6</name>
                            <description>PWM6 description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PWM7</name>
                            <description>PWM7 description</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PWM8</name>
                            <description>PWM8 description</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ADC0</name>
                            <description>ADC0 description</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ADC1</name>
                            <description>ADC1 description</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ADC2</name>
                            <description>ADC2 description</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DAC0</name>
                            <description>DAC0 description</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DAC1</name>
                            <description>DAC1 description</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DAC2</name>
                            <description>DAC2 description</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DAC3</name>
                            <description>DAC3 description</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CMP0</name>
                            <description>CMP0 description</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CMP1</name>
                            <description>CMP1 description</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CMP2</name>
                            <description>CMP2 description</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CMP3</name>
                            <description>CMP3 description</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2C</name>
                            <description>I2C description</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CORDIC</name>
                            <description>CORDIC description</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <!--CPU_CHK0-->
                <register>
                    <name>CPU_CHK0</name>
                    <description>CPU_CHK0 description</description>
                    <addressOffset>0x00000014</addressOffset>
                    <size>0x20</size>
                    <fields>
                        <field>
                            <name>PRES_REG2</name>
                            <description>PRES_REG2 description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>PRES_REG0</name>
                            <description>PRES_REG0 description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
