ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/SVD/MDR1986VK01/MDR1986VK01.svd
                <!--LSI_CHK2-->
                <register>
                    <name>LSI_CHK2</name>
                    <description>LSI_CHK2 description</description>
                    <addressOffset>0x00000030</addressOffset>
                    <size>0x20</size>
                    <fields>
                        <field>
                            <name>BASE_REG0</name>
                            <description>BASE_REG0 description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>BASE_REG1</name>
                            <description>BASE_REG1 description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>BASE_REG2</name>
                            <description>BASE_REG0 description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>BASE_REG3</name>
                            <description>BASE_REG0 description</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <!--LSI_STAT-->
                <register>
                    <name>LSI_STAT</name>
                    <description>LSI_STAT description</description>
                    <addressOffset>0x00000034</addressOffset>
                    <size>0x20</size>
                    <fields>
                        <field>
                            <name>MAX_CHK_SHIFT_REG0</name>
                            <description>MAX_CHK_SHIFT_REG0 description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MAX_CHK_SHIFT_REG1</name>
                            <description>MAX_CHK_SHIFT_REG1 description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EVENT0</name>
                            <description>EVENT0 description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EVENT1</name>
                            <description>EVENT1 description</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EVENT2</name>
                            <description>EVENT2 description</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EVENT3</name>
                            <description>EVENT3 description</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LSI_READY</name>
                            <description>LSI_READY description</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <!--HSI_STAT-->
                <register>
                    <name>HSI_STAT</name>
                    <description>HSI_STAT description</description>
                    <addressOffset>0x00000038</addressOffset>
                    <size>0x20</size>
                    <fields>
                        <field>
                            <name>HSI_READY</name>
                            <description>HSI_READY description</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <!--LSE_CLK-->
                <register>
                    <name>LSE_CLK</name>
                    <description>LSE_CLK description</description>
                    <addressOffset>0x0000003C</addressOffset>
                    <size>0x20</size>
                    <fields>
                        <field>
                            <name>EN_CHK_EVENT0</name>
                            <description>EN_CHK_EVENT0 description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EN_CHK_EVENT1</name>
                            <description>EN_CHK_EVENT1 description</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EN_CHK_EVENT2</name>
                            <description>EN_CHK_EVENT2 description</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EN_CHK_EVENT3</name>
                            <description>EN_CHK_EVENT3 description</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EN_CHK</name>
                            <description>EN_CHK description</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CLR_CHK_SHIFT_REG0</name>
                            <description>CLR_CHK_SHIFT_REG0 description</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CLR_CHK_SHIFT_REG1</name>
                            <description>CLR_CHK_SHIFT_REG1 description</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CLR_CHK_EVENT0</name>
                            <description>CLR_CHK_EVENT0 description</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CLR_CHK_EVENT1</name>
                            <description>CLR_CHK_EVENT1 description</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CLR_CHK_EVENT2</name>
                            <description>CLR_CHK_EVENT2 description</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CLR_CHK_EVENT3</name>
                            <description>CLR_CHK_EVENT3 description</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <!--LSE_CHK0-->
                <register>
                    <name>LSE_CHK0</name>
                    <description>LSE_CHK0 description</description>
                    <addressOffset>0x00000040</addressOffset>
                    <size>0x20</size>
                    <fields>
                        <field>
                            <name>PRES_REG2</name>
                            <description>PRES_REG2 description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>PRES_REG0</name>
                            <description>PRES_REG0 description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <!--LSE_CHK1-->
                <register>
                    <name>LSE_CHK1</name>
                    <description>LSE_CHK1 description</description>
                    <addressOffset>0x00000044</addressOffset>
                    <size>0x20</size>
                    <fields>
                        <field>
                            <name>PRES_REG1</name>
                            <description>PRES_REG1 description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>PRES_REG3</name>
                            <description>PRES_REG3 description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
