ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/SVD/MDR1986VK01/MDR1986VK01.svd
                <!--HSE0_CHK0-->
                <register>
                    <name>HSE0_CHK0</name>
                    <description>HSE0_CHK0 description</description>
                    <addressOffset>0x00000054</addressOffset>
                    <size>0x20</size>
                    <fields>
                        <field>
                            <name>PRES_REG2</name>
                            <description>PRES_REG2 description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>PRES_REG0</name>
                            <description>PRES_REG0 description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <!--HSE0_CHK1-->
                <register>
                    <name>HSE0_CHK1</name>
                    <description>HSE0_CHK1 description</description>
                    <addressOffset>0x00000058</addressOffset>
                    <size>0x20</size>
                    <fields>
                        <field>
                            <name>PRES_REG1</name>
                            <description>PRES_REG1 description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>PRES_REG3</name>
                            <description>PRES_REG3 description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <!--HSE0_CHK2-->
                <register>
                    <name>HSE0_CHK2</name>
                    <description>HSE0_CHK2 description</description>
                    <addressOffset>0x0000005C</addressOffset>
                    <size>0x20</size>
                    <fields>
                        <field>
                            <name>BASE_REG0</name>
                            <description>BASE_REG0 description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>BASE_REG1</name>
                            <description>BASE_REG1 description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>BASE_REG2</name>
                            <description>BASE_REG0 description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>BASE_REG3</name>
                            <description>BASE_REG0 description</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <!--HSE0_STAT-->
                <register>
                    <name>HSE0_STAT</name>
                    <description>HSE0_STAT description</description>
                    <addressOffset>0x00000060</addressOffset>
                    <size>0x20</size>
                    <fields>
                        <field>
                            <name>MAX_CHK_SHIFT_REG0</name>
                            <description>MAX_CHK_SHIFT_REG0 description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MAX_CHK_SHIFT_REG1</name>
                            <description>MAX_CHK_SHIFT_REG1 description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EVENT0</name>
                            <description>EVENT0 description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EVENT1</name>
                            <description>EVENT1 description</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EVENT2</name>
                            <description>EVENT2 description</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EVENT3</name>
                            <description>EVENT3 description</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HSE_RDY</name>
                            <description>HSE_RDY description</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
