ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/SVD/MDR1986VK01/MDR1986VK01.svd
                <!--HSE1_CLK-->
                <register derivedFrom="HSE0_CLK">
                    <name>HSE1_CLK</name>
                    <description>HSE1_CLK description</description>
                    <addressOffset>0x00000064</addressOffset>
                </register>
                <!--HSE1_CHK0-->
                <register derivedFrom="HSE0_CHK0">
                    <name>HSE1_CHK0</name>
                    <description>HSE1_CHK0 description</description>
                    <addressOffset>0x00000068</addressOffset>
                </register>
                <!--HSE1_CHK1-->
                <register derivedFrom="HSE0_CHK1">
                    <name>HSE1_CHK1</name>
                    <description>HSE1_CHK1 description</description>
                    <addressOffset>0x0000006C</addressOffset>
                </register>
                <!--HSE1_CHK2-->
                <register derivedFrom="HSE0_CHK2">
                    <name>HSE1_CHK2</name>
                    <description>HSE1_CHK2 description</description>
                    <addressOffset>0x00000070</addressOffset>
                </register>
                <!--HSE1_STAT-->
                <register derivedFrom="HSE0_STAT">
                    <name>HSE1_STAT</name>
                    <description>HSE1_STAT description</description>
                    <addressOffset>0x00000074</addressOffset>
                </register>
                <!--PLL0_CLK-->
                <register>
                    <name>PLL0_CLK</name>
                    <description>PLL0_CLK description</description>
                    <addressOffset>0x00000078</addressOffset>
                    <size>0x20</size>
                    <fields>
                        <field>
                            <name>PLL_Q</name>
                            <description>PLL_Q description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>PLL_N</name>
                            <description>PLL_N description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>9</bitWidth>
                        </field>
                        <field>
                            <name>PLL_DV</name>
                            <description>PLL_DV description</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Div1</name>
                                    <description>FOUT = FINT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Div2</name>
                                    <description>FOUT = FINT/2</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Div4</name>
                                    <description>FOUT = FINT/4</description>
                                    <value>2</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PLL_RDYMODE</name>
                            <description>PLL_RDYMODE description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PLL_ON</name>
                            <description>PLL_ON description</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SELECT</name>
                            <description>SELECT description</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>3</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>HSI</name>
                                    <description>HSI is PLL source</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HSI/2</name>
                                    <description>HSI/2 is PLL source</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HSE0</name>
                                    <description>HSE0 is PLL source</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HSE0/2</name>
                                    <description>HSE0/2 is PLL source</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HSE1</name>
                                    <description>HSE1 is PLL source</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HSE1/2</name>
                                    <description>HSE1/2 is PLL source</description>
                                    <value>5</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>EN_CHK_EVENT0</name>
                            <description>EN_CHK_EVENT0 description</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EN_CHK_EVENT1</name>
                            <description>EN_CHK_EVENT1 description</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EN_CHK_EVENT2</name>
                            <description>EN_CHK_EVENT2 description</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EN_CHK_EVENT3</name>
                            <description>EN_CHK_EVENT3 description</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EN_CHK</name>
                            <description>EN_CHK description</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CLR_CHK_SHIFT_REG0</name>
                            <description>CLR_CHK_SHIFT_REG0 description</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CLR_CHK_SHIFT_REG1</name>
                            <description>CLR_CHK_SHIFT_REG1 description</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CLR_CHK_EVENT0</name>
                            <description>CLR_CHK_EVENT0 description</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CLR_CHK_EVENT1</name>
                            <description>CLR_CHK_EVENT1 description</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CLR_CHK_EVENT2</name>
                            <description>CLR_CHK_EVENT2 description</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CLR_CHK_EVENT3</name>
                            <description>CLR_CHK_EVENT3 description</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <!--PLL0_CHK0-->
                <register>
                    <name>PLL0_CHK0</name>
                    <description>PLL0_CHK0 description</description>
                    <addressOffset>0x0000007C</addressOffset>
                    <size>0x20</size>
                    <fields>
                        <field>
                            <name>PRES_REG0</name>
                            <description>PRES_REG0 description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>PRES_REG1</name>
                            <description>PRES_REG1 description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
