ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/SVD/MDR1986VK01/MDR1986VK01.svd
                <!--PLL0_CHK1-->
                <register>
                    <name>PLL0_CHK1</name>
                    <description>PLL0_CHK1 description</description>
                    <addressOffset>0x00000080</addressOffset>
                    <size>0x20</size>
                    <fields>
                        <field>
                            <name>PRES_REG2</name>
                            <description>PRES_REG2 description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>PRES_REG3</name>
                            <description>PRES_REG3 description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <!--PLL0_CHK2-->
                <register>
                    <name>PLL0_CHK2</name>
                    <description>PLL0_CHK2 description</description>
                    <addressOffset>0x00000084</addressOffset>
                    <size>0x20</size>
                    <fields>
                        <field>
                            <name>BASE_REG0</name>
                            <description>BASE_REG0 description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>BASE_REG1</name>
                            <description>BASE_REG1 description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>BASE_REG2</name>
                            <description>BASE_REG2 description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>BASE_REG3</name>
                            <description>BASE_REG3 description</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <!--PLL0_STAT-->
                <register>
                    <name>PLL0_STAT</name>
                    <description>PLL0_STAT description</description>
                    <addressOffset>0x00000088</addressOffset>
                    <size>0x20</size>
                    <fields>
                        <field>
                            <name>MAX_CHK_SHIFT_REG0</name>
                            <description>MAX_CHK_SHIFT_REG0 description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MAX_CHK_SHIFT_REG1</name>
                            <description>MAX_CHK_SHIFT_REG1 description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EVENT0</name>
                            <description>EVENT0 description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EVENT1</name>
                            <description>EVENT1 description</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EVENT2</name>
                            <description>EVENT2 description</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EVENT3</name>
                            <description>EVENT3 description</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PLL_READY</name>
                            <description>PLL_READY description</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <!--PLL1_CLK-->
                <register derivedFrom="PLL0_CLK">
                    <name>PLL1_CLK</name>
                    <description>PLL1_CLK description</description>
                    <addressOffset>0x0000008C</addressOffset>
                </register>
                <!--PLL1_CHK0-->
                <register derivedFrom="PLL0_CHK0">
                    <name>PLL1_CHK0</name>
                    <description>PLL1_CHK0 description</description>
                    <addressOffset>0x00000090</addressOffset>
                </register>
                <!--PLL1_CHK1-->
                <register derivedFrom="PLL0_CHK1">
                    <name>PLL1_CHK1</name>
                    <description>PLL1_CHK1 description</description>
                    <addressOffset>0x00000094</addressOffset>
                </register>
                <!--PLL1_CHK2-->
                <register derivedFrom="PLL0_CHK2">
                    <name>PLL1_CHK2</name>
                    <description>PLL1_CHK2 description</description>
                    <addressOffset>0x00000098</addressOffset>
                </register>
                <!--PLL1_STAT-->
                <register derivedFrom="PLL0_STAT">
                    <name>PLL1_STAT</name>
                    <description>PLL1_STAT description</description>
                    <addressOffset>0x0000009C</addressOffset>
                </register>
                <!--PLL2_CLK-->
                <register derivedFrom="PLL0_CLK">
                    <name>PLL2_CLK</name>
                    <description>PLL2_CLK description</description>
                    <addressOffset>0x000000A0</addressOffset>
                </register>
                <!--PLL2_CHK0-->
                <register derivedFrom="PLL0_CHK0">
                    <name>PLL2_CHK0</name>
                    <description>PLL2_CHK0 description</description>
                    <addressOffset>0x000000A4</addressOffset>
                </register>
                <!--PLL2_CHK1-->
                <register derivedFrom="PLL0_CHK1">
                    <name>PLL2_CHK1</name>
                    <description>PLL2_CHK1 description</description>
                    <addressOffset>0x000000A8</addressOffset>
                </register>
