ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/SVD/MDR1986VK01/MDR1986VK01.svd
                <!--PLL2_CHK2-->
                <register derivedFrom="PLL0_CHK2">
                    <name>PLL2_CHK2</name>
                    <description>PLL2_CHK2 description</description>
                    <addressOffset>0x000000AC</addressOffset>
                </register>
                <!--PLL2_STAT-->
                <register derivedFrom="PLL0_STAT">
                    <name>PLL2_STAT</name>
                    <description>PLL2_STAT description</description>
                    <addressOffset>0x000000B0</addressOffset>
                </register>
                <!--PLL3_CLK-->
                <register derivedFrom="PLL0_CLK">
                    <name>PLL3_CLK</name>
                    <description>PLL3_CLK description</description>
                    <addressOffset>0x000000B4</addressOffset>
                </register>
                <!--PLL3_CHK0-->
                <register derivedFrom="PLL0_CHK0">
                    <name>PLL3_CHK0</name>
                    <description>PLL3_CHK0 description</description>
                    <addressOffset>0x000000B8</addressOffset>
                </register>
                <!--PLL3_CHK1-->
                <register derivedFrom="PLL0_CHK1">
                    <name>PLL3_CHK1</name>
                    <description>PLL3_CHK1 description</description>
                    <addressOffset>0x000000BC</addressOffset>
                </register>
                <!--PLL3_CHK2-->
                <register derivedFrom="PLL0_CHK2">
                    <name>PLL3_CHK2</name>
                    <description>PLL3_CHK2 description</description>
                    <addressOffset>0x000000C0</addressOffset>
                </register>
                <!--PLL3_STAT-->
                <register derivedFrom="PLL0_STAT">
                    <name>PLL3_STAT</name>
                    <description>PLL3_STAT description</description>
                    <addressOffset>0x000000C4</addressOffset>
                </register>
                <!--EMAC_CLK-->
                <register>
                    <name>EMAC_CLK</name>
                    <description>EMAC_CLK description</description>
                    <addressOffset>0x000000C8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>DIV</name>
                            <description>DIV description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>EN_CLK</name>
                            <description>EN_CLK description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SELECT</name>
                            <description>SELECT description</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>4</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>HSI</name>
                                    <description>HSI selected</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HSE0</name>
                                    <description>HSE0 selected</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HSE1</name>
                                    <description>HSE1 selected</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LSI</name>
                                    <description>LSI selected</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LSE</name>
                                    <description>LSE selected</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PLL0</name>
                                    <description>PLL0 selected</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PLL1</name>
                                    <description>PLL1 selected</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PLL2</name>
                                    <description>PLL2 selected</description>
                                    <value>7</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PLL3</name>
                                    <description>PLL3 selected</description>
                                    <value>8</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MAX_CLK</name>
                                    <description>MAX_CLK selected</description>
                                    <value>13</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
