ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/SVD/MDR1986VK01/MDR1986VK01.svd
                <!--USB_CLK-->
                <register derivedFrom="EMAC_CLK">
                    <name>USB_CLK</name>
                    <description>USB_CLK description</description>
                    <addressOffset>0x000000CC</addressOffset>
                </register>
                <!--USBMAC_CLK-->
                <register>
                    <name>USBMAC_CLK</name>
                    <description>USBMAC_CLK description</description>
                    <addressOffset>0x000000D0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>DIV</name>
                            <description>DIV description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>EN_CLK</name>
                            <description>EN_CLK description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <!--RTC0_CLK-->
                <register derivedFrom="EMAC_CLK">
                    <name>RTC0_CLK</name>
                    <description>RTC0_CLK description</description>
                    <addressOffset>0x000000D4</addressOffset>
                </register>
                <!--SSP0_CLK-->
                <register derivedFrom="EMAC_CLK">
                    <name>SSP0_CLK</name>
                    <description>SSP0_CLK description</description>
                    <addressOffset>0x000000D8</addressOffset>
                </register>
                <!--SSP1_CLK-->
                <register derivedFrom="EMAC_CLK">
                    <name>SSP1_CLK</name>
                    <description>SSP1_CLK description</description>
                    <addressOffset>0x000000DC</addressOffset>
                </register>
                <!--CAN0_CLK-->
                <register derivedFrom="USBMAC_CLK">
                    <name>CAN0_CLK</name>
                    <description>CAN0_CLK description</description>
                    <addressOffset>0x000000E0</addressOffset>
                </register>
                <!--CAN1_CLK-->
                <register derivedFrom="USBMAC_CLK">
                    <name>CAN1_CLK</name>
                    <description>CAN1_CLK description</description>
                    <addressOffset>0x000000E4</addressOffset>
                </register>
                <!--UART0_CLK-->
                <register derivedFrom="EMAC_CLK">
                    <name>UART0_CLK</name>
                    <description>UART0_CLK description</description>
                    <addressOffset>0x000000E8</addressOffset>
                </register>
                <!--UART1_CLK-->
                <register derivedFrom="EMAC_CLK">
                    <name>UART1_CLK</name>
                    <description>UART1_CLK description</description>
                    <addressOffset>0x000000EC</addressOffset>
                </register>
                <!--UART2_CLK-->
                <register derivedFrom="EMAC_CLK">
                    <name>UART2_CLK</name>
                    <description>UART2_CLK description</description>
                    <addressOffset>0x000000F0</addressOffset>
                </register>
                <!--UART3_CLK-->
                <register derivedFrom="EMAC_CLK">
                    <name>UART3_CLK</name>
                    <description>UART3_CLK description</description>
                    <addressOffset>0x000000F4</addressOffset>
                </register>
                <!--MIL0_CLK-->
                <register derivedFrom="USBMAC_CLK">
                    <name>MIL0_CLK</name>
                    <description>MIL0_CLK description</description>
                    <addressOffset>0x000000F8</addressOffset>
                </register>
                <!--TIM0_CLK-->
                <register derivedFrom="USBMAC_CLK">
                    <name>TIM0_CLK</name>
                    <description>TIM0_CLK description</description>
                    <addressOffset>0x000000FC</addressOffset>
                </register>
                <!--TIM1_CLK-->
                <register derivedFrom="USBMAC_CLK">
                    <name>TIM1_CLK</name>
                    <description>TIM1_CLK description</description>
                    <addressOffset>0x00000100</addressOffset>
                </register>
                <!--TIM2_CLK-->
                <register derivedFrom="USBMAC_CLK">
                    <name>TIM2_CLK</name>
                    <description>TIM2_CLK description</description>
                    <addressOffset>0x00000104</addressOffset>
                </register>
                <!--TIM3_CLK-->
                <register derivedFrom="USBMAC_CLK">
                    <name>TIM3_CLK</name>
                    <description>TIM3_CLK description</description>
                    <addressOffset>0x0000010C</addressOffset>
                </register>
                <!--CAP0_CLK-->
                <register derivedFrom="USBMAC_CLK">
                    <name>CAP0_CLK</name>
                    <description>CAP0_CLK description</description>
                    <addressOffset>0x00000110</addressOffset>
                </register>
                <!--CAP1_CLK-->
                <register derivedFrom="USBMAC_CLK">
                    <name>CAP1_CLK</name>
                    <description>CAP1_CLK description</description>
                    <addressOffset>0x00000114</addressOffset>
                </register>
                <!--CAP2_CLK-->
                <register derivedFrom="USBMAC_CLK">
                    <name>CAP2_CLK</name>
                    <description>CAP2_CLK description</description>
                    <addressOffset>0x00000118</addressOffset>
                </register>
                <!--CAP3_CLK-->
                <register derivedFrom="USBMAC_CLK">
                    <name>CAP3_CLK</name>
                    <description>CAP3_CLK description</description>
                    <addressOffset>0x0000011C</addressOffset>
                </register>
                <!--QEP0_CLK-->
                <register derivedFrom="USBMAC_CLK">
                    <name>QEP0_CLK</name>
                    <description>QEP0_CLK description</description>
                    <addressOffset>0x00000120</addressOffset>
                </register>
                <!--QEP1_CLK-->
                <register derivedFrom="USBMAC_CLK">
                    <name>QEP1_CLK</name>
                    <description>QEP1_CLK description</description>
                    <addressOffset>0x00000124</addressOffset>
                </register>
                <!--PWM0_CLK-->
                <register derivedFrom="USBMAC_CLK">
                    <name>PWM0_CLK</name>
                    <description>PWM0_CLK description</description>
                    <addressOffset>0x00000128</addressOffset>
                </register>
