ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/SVD/MDR1986VK01/MDR1986VK01.svd
                <!--PWM1_CLK-->
                <register derivedFrom="USBMAC_CLK">
                    <name>PWM1_CLK</name>
                    <description>PWM1_CLK description</description>
                    <addressOffset>0x0000012C</addressOffset>
                </register>
                <!--PWM2_CLK-->
                <register derivedFrom="USBMAC_CLK">
                    <name>PWM2_CLK</name>
                    <description>PWM2_CLK description</description>
                    <addressOffset>0x00000130</addressOffset>
                </register>
                <!--PWM3_CLK-->
                <register derivedFrom="USBMAC_CLK">
                    <name>PWM3_CLK</name>
                    <description>PWM3_CLK description</description>
                    <addressOffset>0x00000134</addressOffset>
                </register>
                <!--PWM4_CLK-->
                <register derivedFrom="USBMAC_CLK">
                    <name>PWM4_CLK</name>
                    <description>PWM4_CLK description</description>
                    <addressOffset>0x00000138</addressOffset>
                </register>
                <!--PWM5_CLK-->
                <register derivedFrom="USBMAC_CLK">
                    <name>PWM5_CLK</name>
                    <description>PWM5_CLK description</description>
                    <addressOffset>0x0000013C</addressOffset>
                </register>
                <!--PWM6_CLK-->
                <register derivedFrom="USBMAC_CLK">
                    <name>PWM6_CLK</name>
                    <description>PWM6_CLK description</description>
                    <addressOffset>0x00000140</addressOffset>
                </register>
                <!--PWM7_CLK-->
                <register derivedFrom="USBMAC_CLK">
                    <name>PWM7_CLK</name>
                    <description>PWM7_CLK description</description>
                    <addressOffset>0x00000144</addressOffset>
                </register>
                <!--PWM8_CLK-->
                <register derivedFrom="USBMAC_CLK">
                    <name>PWM8_CLK</name>
                    <description>PWM8_CLK description</description>
                    <addressOffset>0x00000148</addressOffset>
               </register>
                <!--ADC0_CLK-->
                <register derivedFrom="EMAC_CLK">
                    <name>ADC0_CLK</name>
                    <description>ADC0_CLK description</description>
                    <addressOffset>0x0000014C</addressOffset>
                </register>
                <!--ADC1_CLK-->
                <register derivedFrom="EMAC_CLK">
                    <name>ADC1_CLK</name>
                    <description>ADC1_CLK description</description>
                    <addressOffset>0x000001D0</addressOffset>
                </register>
                <!--ADC2_CLK-->
                <register derivedFrom="EMAC_CLK">
                    <name>ADC2_CLK</name>
                    <description>ADC2_CLK description</description>
                    <addressOffset>0x000001D4</addressOffset>
                </register>
                <!--CRDC_CLK-->
                <register derivedFrom="EMAC_CLK">
                    <name>CRDC_CLK</name>
                    <description>CRDC_CLK description</description>
                    <addressOffset>0x000001D8</addressOffset>
                </register>
                <!--CANFD_CLK-->
                <register derivedFrom="EMAC_CLK">
                    <name>CANFD_CLK</name>
                    <description>CANFD_CLK description</description>
                    <addressOffset>0x000001DC</addressOffset>
                </register>
                <!--CRPT_CLK-->
                <register derivedFrom="EMAC_CLK">
                    <name>CRPT_CLK</name>
                    <description>CRPT_CLK description</description>
                    <addressOffset>0x000001E0</addressOffset>
                </register>
                <!--SDIO_CLK-->
                <register derivedFrom="EMAC_CLK">
                    <name>SDIO_CLK</name>
                    <description>SDIO_CLK description</description>
                    <addressOffset>0x000001E4</addressOffset>
                </register>
            </registers>
        </peripheral>
        <!--MDR_BKP-->
        <peripheral>
            <name>MDR_BKP</name>
            <description>MDR_BKP description</description>
            <groupName>MDR_BKP</groupName>
            <baseAddress>0x40001000</baseAddress>
            <access>read-write</access>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <!--KEY-->
                <register>
                    <name>KEY</name>
                    <description>KEY description</description>
                    <addressOffset>0x000000F0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <!--REG_xx-->
                <register>
                    <name>REG_00</name>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
                <register>
                    <name>REG_01</name>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
                <register>
                    <name>REG_02</name>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
                <register>
                    <name>REG_03</name>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
                <register>
                    <name>REG_04</name>
                    <addressOffset>0x00000010</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
                <register>
                    <name>REG_05</name>
                    <addressOffset>0x00000014</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
                <register>
                    <name>REG_06</name>
                    <addressOffset>0x00000018</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
                <register>
                    <name>REG_07</name>
                    <addressOffset>0x0000001C</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
                <register>
                    <name>REG_08</name>
                    <addressOffset>0x00000020</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
                <register>
                    <name>REG_09</name>
                    <addressOffset>0x00000024</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
                <register>
                    <name>REG_10</name>
                    <addressOffset>0x00000028</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
                <register>
                    <name>REG_11</name>
                    <addressOffset>0x0000002C</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
                <register>
                    <name>REG_12</name>
                    <addressOffset>0x00000030</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
                <register>
                    <name>REG_13</name>
                    <addressOffset>0x00000034</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
                <register>
                    <name>REG_14</name>
                    <addressOffset>0x00000038</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
                <register>
                    <name>REG_15</name>
                    <addressOffset>0x0000003C</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
                <register>
                    <name>REG_16</name>
                    <addressOffset>0x00000040</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
                <register>
                    <name>REG_17</name>
                    <addressOffset>0x00000044</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
                <register>
                    <name>REG_18</name>
                    <addressOffset>0x00000048</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
                <register>
                    <name>REG_19</name>
                    <addressOffset>0x0000004C</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
                <register>
                    <name>REG_20</name>
                    <addressOffset>0x00000050</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
                <register>
                    <name>REG_21</name>
                    <addressOffset>0x00000054</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
                <register>
                    <name>REG_22</name>
                    <addressOffset>0x00000058</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
                <register>
                    <name>REG_23</name>
                    <addressOffset>0x0000005C</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
                <register>
                    <name>REG_24</name>
                    <addressOffset>0x00000060</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
                <register>
                    <name>REG_25</name>
                    <addressOffset>0x00000064</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
                <register>
                    <name>REG_26</name>
                    <addressOffset>0x00000068</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
                <register>
                    <name>REG_27</name>
                    <addressOffset>0x0000006C</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
                <register>
                    <name>REG_28</name>
                    <addressOffset>0x00000070</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
                <register>
                    <name>REG_29</name>
                    <addressOffset>0x00000074</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
                <register>
                    <name>REG_30</name>
                    <addressOffset>0x00000078</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
                <register>
                    <name>REG_31</name>
                    <addressOffset>0x0000007C</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
                <register>
                    <name>REG_32</name>
                    <addressOffset>0x00000080</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
                <register>
                    <name>REG_33</name>
                    <addressOffset>0x00000084</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
                <register>
                    <name>REG_34</name>
                    <addressOffset>0x00000088</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
                <register>
                    <name>REG_35</name>
                    <addressOffset>0x0000008C</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
                <register>
                    <name>REG_36</name>
                    <addressOffset>0x00000090</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
                <register>
                    <name>REG_37</name>
                    <addressOffset>0x00000094</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
                <register>
                    <name>REG_38</name>
                    <addressOffset>0x00000098</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
                <register>
                    <name>REG_39</name>
                    <addressOffset>0x0000009C</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
                <register>
                    <name>REG_40</name>
                    <addressOffset>0x000000A0</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
                <register>
                    <name>REG_41</name>
                    <addressOffset>0x000000A4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>REG_42</name>
                    <addressOffset>0x000000A8</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
                <register>
                    <name>REG_43</name>
                    <addressOffset>0x000000AC</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
                <register>
                    <name>REG_44</name>
                    <addressOffset>0x000000B0</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
                <register>
                    <name>REG_45</name>
                    <addressOffset>0x000000B4</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
                <register>
                    <name>REG_46</name>
                    <addressOffset>0x000000B8</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
                <register>
                    <name>REG_47</name>
                    <addressOffset>0x000000BC</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
                <register>
                    <name>REG_48</name>
                    <addressOffset>0x000000C0</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
                <register>
                    <name>REG_49</name>
                    <addressOffset>0x000000C4</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
                <register>
                    <name>REG_50</name>
                    <addressOffset>0x000000C8</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
                <register>
                    <name>REG_51</name>
                    <addressOffset>0x000000CC</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
                <register>
                    <name>REG_52</name>
                    <addressOffset>0x000000D0</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
                <register>
                    <name>REG_53</name>
                    <addressOffset>0x000000D4</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
                <register>
                    <name>REG_54</name>
                    <addressOffset>0x000000D8</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
                <register>
                    <name>REG_55</name>
                    <addressOffset>0x000000DC</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
                <register>
                    <name>REG_56</name>
                    <addressOffset>0x000000E0</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
                <register>
                    <name>REG_57</name>
                    <addressOffset>0x000000E4</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
                <register>
                    <name>REG_58</name>
                    <addressOffset>0x000000E8</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
                <register>
                    <name>REG_59</name>
                    <addressOffset>0x000000EC</addressOffset>
                    <size>0x20</size>
                    <fields/>
                </register>
                <!--REG_60_SYS0-->
                <register>
                    <name>REG_60_SYS0</name>
                    <description>REG_60_SYS0 description</description>
                    <addressOffset>0x00000100</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>MODE</name>
                            <description>MODE description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>FPOR</name>
                            <description>FPOR description</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DISABLE_JTAG</name>
                            <description>DISABLE_JTAG description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LOCKSTEP_DIS</name>
                            <description>LOCKSTEP_DIS description</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SYSRSTn</name>
                            <description>SYSRSTn description</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IORST0n</name>
                            <description>IORST0n description</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FTRST</name>
                            <description>FTRST description</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WDGRST0n</name>
                            <description>WDGRST0n description</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ERR_60</name>
                            <description>ERR_60 description</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ERR_LDO</name>
                            <description>ERR_LDO description</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ERR_63</name>
                            <description>ERR_63 description</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CLR_ERR</name>
                            <description>CLR_ERR description</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ERR_IE</name>
                            <description>ERR_IE description</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <!--REG_60_SYS1-->
                <register derivedFrom="REG_60_SYS0">
                    <name>REG_60_SYS1</name>
                    <description>REG_60_SYS1 description</description>
                    <addressOffset>0x00000110</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                </register>
                <!--REG_60_SYS2-->
                <register derivedFrom="REG_60_SYS0">
                    <name>REG_60_SYS2</name>
                    <description>REG_60_SYS2 description</description>
                    <addressOffset>0x00000120</addressOffset>
                    <size>0x20</size>
                </register>
