ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/SVD/MDR1986VK01/MDR1986VK01.svd
                <!--REG_61_PWR0-->
                <register>
                    <name>REG_61_PWR0</name>
                    <description>REG_61_PWR0 description</description>
                    <addressOffset>0x00000104</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>POR3p3_DIS</name>
                            <description>POR3p3_DIS description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OVR3p3_DIS</name>
                            <description>OVR3p3_DIS description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TRIM_Vcc1p6</name>
                            <description>TRIM_Vcc1p6 description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>TRIM_Vcc1p2</name>
                            <description>TRIM_Vcc1p2 description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>DCDC_EN</name>
                            <description>DCDC_EN description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DCDC_TRIM_TOFF</name>
                            <description>DCDC_TRIM_TOFF description</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>HLDO_SIRLOW</name>
                            <description>HLDO_SIRLOW description</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>HLDO_DIS</name>
                            <description>HLDO_DIS description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LLDO_DIS</name>
                            <description>LLDO_DIS description</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TPROT_EN</name>
                            <description>TPROT_EN description</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CPROT_EN</name>
                            <description>CPROT_EN description</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>POR3p3_RDY</name>
                            <description>POR3p3_RDY description</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>nPOR3p3</name>
                            <description>nPOR3p3 description</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>nPOR1p6</name>
                            <description>nPOR1p6 description</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>nPOR1p2</name>
                            <description>nPOR1p2 description</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>nOVRST3p3</name>
                            <description>nOVRST3p3 description</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LLDO_RDY</name>
                            <description>LLDO_RDY description</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DCDC_RDY</name>
                            <description>DCDC_RDY description</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>HLDO_RDY</name>
                            <description>HLDO_RDY description</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CPROT_EVENT</name>
                            <description>CPROT_EVENT description</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TPROT_EVENT</name>
                            <description>TPROT_EVENT description</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>STANDBY</name>
                            <description>STANDBY description</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <!--REG_61_PWR1-->
                <register derivedFrom="REG_61_PWR0">
                    <name>REG_61_PWR1</name>
                    <description>REG_61_PWR1 description</description>
                    <addressOffset>0x00000114</addressOffset>
                </register>
                <!--REG_61_PWR2-->
                <register derivedFrom="REG_61_PWR0">
                    <name>REG_61_PWR2</name>
                    <description>REG_61_PWR2 description</description>
                    <addressOffset>0x00000124</addressOffset>
                </register>
                <!--REG_62_PWR0-->
                <register>
                    <name>REG_62_PWR0</name>
                    <description>REG_62_PWR0 description</description>
                    <addressOffset>0x00000108</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>BLDO_READY</name>
                            <description>BLDO_READY description</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PWRM_Vcc_LVL</name>
                            <description>PWRM_Vcc_LVL description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>PWRM_Vcc_EN</name>
                            <description>PWRM_Vcc_EN description</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PWRM_B_Vcc_LVL</name>
                            <description>PWRM_B_Vcc_LVL description</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>PWRM_IO_Vcc_LVL</name>
                            <description>PWRM_IO_Vcc_LVL description</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>PWRM_B_Vcc_EN</name>
                            <description>PWRM_B_Vcc_EN description</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PWRM_IO_Vcc_EN</name>
                            <description>PWRM_IO_Vcc_EN description</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PWRM_Vcc_EVENT</name>
                            <description>PWRM_Vcc_EVENT description</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PWRM_B_Vcc_EVENT</name>
                            <description>PWRM_B_Vcc_EVENT description</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PWRM_IO_Vcc_EVENT</name>
                            <description>PWRM_IO_Vcc_EVENT description</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SEL_nSW</name>
                            <description>SEL_nSW description</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SEL_SW</name>
                            <description>SEL_SW description</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PMU_BG_DIS</name>
                            <description>PMU_BG_DIS description</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
