ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/SVD/MDR1986VK01/MDR1986VK01.svd
                <!--REG_62_PWR1-->
                <register derivedFrom="REG_62_PWR0">
                    <name>REG_62_PWR1</name>
                    <description>REG_62_PWR1 description</description>
                    <addressOffset>0x00000118</addressOffset>
                </register>
                <!--REG_62_PWR2-->
                <register derivedFrom="REG_62_PWR0">
                    <name>REG_62_PWR2</name>
                    <description>REG_62_PWR2 description</description>
                    <addressOffset>0x00000128</addressOffset>
                </register>
                <!--REG_63_CLK0-->
                <register>
                    <name>REG_63_CLK0</name>
                    <description>REG_63_CLK0 description</description>
                    <addressOffset>0x0000010C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>LSE_RDY</name>
                            <description>LSE_RDY description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LSE_FILTER_EN</name>
                            <description>LSE_FILTER_EN description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LSE_BYP</name>
                            <description>LSE_BYP description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LSE_ON</name>
                            <description>LSE_ON description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HSE0_RDY</name>
                            <description>HSE0_RDY description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>HSE0_FILTER_EN</name>
                            <description>HSE0_FILTER_EN description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HSE0_BYP</name>
                            <description>HSE0_BYP description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HSE0_ON</name>
                            <description>HSE0_ON description</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HSE1_RDY</name>
                            <description>HSE1_RDY description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>HSE1_FILTER_EN</name>
                            <description>HSE1_FILTER_EN description</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HSE1_BYP</name>
                            <description>HSE1_BYP description</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HSE1_ON</name>
                            <description>HSE1_ON description</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LSI_RDY</name>
                            <description>LSI_RDY description</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LSI_OFF</name>
                            <description>LSI_OFF description</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LSI_TRIM</name>
                            <description>LSI_TRIM description</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>HSI_RDY</name>
                            <description>HSI_RDY description</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>HSI_TRIM</name>
                            <description>HSI_TRIM description</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>HSI_OFF</name>
                            <description>HSI_OFF description</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LSI_POR_READY</name>
                            <description>LSI_POR_READY description</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!--REG_63_CLK1-->
                <register derivedFrom="REG_63_CLK0">
                    <name>REG_63_CLK1</name>
                    <description>REG_63_CLK1 description</description>
                    <addressOffset>0x0000011C</addressOffset>
                </register>
                <!--REG_63_CLK2-->
                <register derivedFrom="REG_63_CLK0">
                    <name>REG_63_CLK2</name>
                    <description>REG_63_CLK2 description</description>
                    <addressOffset>0x0000012C</addressOffset>
                </register>
                <!--REG_64_TMR0-->
                <register>
                    <name>REG_64_TMR0</name>
                    <description>REG_64_TMR0 description</description>
                    <addressOffset>0x000000F4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>RTCSEL</name>
                            <description>RTCSEL description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>LSI</name>
                                    <description>LSI selected</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LSE</name>
                                    <description>LSE selected</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RTC_CLK</name>
                                    <description>RTC_CLK selected</description>
                                    <value>2</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RTCCAL</name>
                            <description>RTCCAL description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>RTCRST</name>
                            <description>RTCRST description</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTCEN</name>
                            <description>RTCEN description</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CPROT_LIM</name>
                            <description>CPROT_LIM description</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>CPROT_CNT</name>
                            <description>CPROT_CNT description</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>10</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
