ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/SVD/MDR1986VK01/MDR1986VK01.svd
                <!--REG_64_TMR1-->
                <register derivedFrom="REG_64_TMR0">
                    <name>REG_64_TMR1</name>
                    <description>REG_64_TMR1 description</description>
                    <addressOffset>0x000000F8</addressOffset>
                </register>
                <!--REG_64_TMR2-->
                <register derivedFrom="REG_64_TMR0">
                    <name>REG_64_TMR2</name>
                    <description>REG_64_TMR2 description</description>
                    <addressOffset>0x000000FC</addressOffset>
                </register>
                <!--RTC_CNT_TMR0-->
                <register>
                    <name>RTC_CNT_TMR0</name>
                    <description>RTC_CNT_TMR0 description</description>
                    <addressOffset>0x00000130</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <!--RTC_CNT_TMR1-->
                <register derivedFrom="RTC_CNT_TMR0">
                    <name>RTC_CNT_TMR1</name>
                    <description>RTC_CNT_TMR1 description</description>
                    <addressOffset>0x00000150</addressOffset>
                </register>
                <!--RTC_CNT_TMR2-->
                <register derivedFrom="RTC_CNT_TMR0">
                    <name>RTC_CNT_TMR2</name>
                    <description>RTC_CNT_TMR2 description</description>
                    <addressOffset>0x00000170</addressOffset>
                </register>
                <!--RTC_DIV_TMR0-->
                <register>
                    <name>RTC_DIV_TMR0</name>
                    <description>RTC_DIV_TMR0 description</description>
                    <addressOffset>0x00000134</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>DIV</name>
                            <description>DIV description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
                <!--RTC_DIV_TMR1-->
                <register derivedFrom="RTC_DIV_TMR0">
                    <name>RTC_DIV_TMR1</name>
                    <description>RTC_DIV_TMR1 description</description>
                    <addressOffset>0x00000154</addressOffset>
                </register>
                <!--RTC_DIV_TMR2-->
                <register derivedFrom="RTC_DIV_TMR0">
                    <name>RTC_DIV_TMR2</name>
                    <description>RTC_DIV_TMR2 description</description>
                    <addressOffset>0x00000174</addressOffset>
                </register>
                <!--RTC_PRL_TMR0-->
                <register>
                    <name>RTC_PRL_TMR0</name>
                    <description>RTC_PRL_TMR0 description</description>
                    <addressOffset>0x00000138</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PRL</name>
                            <description>PRL description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
                <!--RTC_PRL_TMR1-->
                <register derivedFrom="RTC_PRL_TMR0">
                    <name>RTC_PRL_TMR1</name>
                    <description>RTC_PRL_TMR1 description</description>
                    <addressOffset>0x00000158</addressOffset>
                </register>
                <!--RTC_PRL_TMR2-->
                <register derivedFrom="RTC_PRL_TMR0">
                    <name>RTC_PRL_TMR2</name>
                    <description>RTC_PRL_TMR2 description</description>
                    <addressOffset>0x00000178</addressOffset>
                </register>
                <!--RTC_ALRM_TMR0-->
                <register>
                    <name>RTC_ALRM_TMR0</name>
                    <description>RTC_ALRM_TMR0 description</description>
                    <addressOffset>0x0000013C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <!--RTC_ALRM_TMR1-->
                <register derivedFrom="RTC_ALRM_TMR0">
                    <name>RTC_ALRM_TMR1</name>
                    <description>RTC_ALRM_TMR1 description</description>
                    <addressOffset>0x0000015C</addressOffset>
                </register>
                <!--RTC_ALRM_TMR2-->
                <register derivedFrom="RTC_ALRM_TMR0">
                    <name>RTC_ALRM_TMR2</name>
                    <description>RTC_ALRM_TMR2 description</description>
                    <addressOffset>0x0000017C</addressOffset>
                </register>
                <!--RTC_CS_TMR0-->
                <register>
                    <name>RTC_CS_TMR0</name>
                    <description>RTC_CS_TMR0 description</description>
                    <addressOffset>0x00000140</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>OWF</name>
                            <description>OWF description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SECF</name>
                            <description>SECF description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ALRF</name>
                            <description>ALRF description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OWF_IE</name>
                            <description>OWF_IE description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SECF_IE</name>
                            <description>SECF_IE description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ALRF_IE</name>
                            <description>ALRF_IE description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WEC</name>
                            <description>WEC description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CLR_ERRx</name>
                            <description>CLR_ERRx description</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ERR_CNT</name>
                            <description>ERR_CNT description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ERR_DIV</name>
                            <description>ERR_DIV description</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ERR_CM</name>
                            <description>ERR_CM description</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ERR_CC</name>
                            <description>ERR_CC description</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ERR_CNTx</name>
                            <description>ERR_CNTx description</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ERR_RTCx</name>
                            <description>ERR_RTCx description</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ERR_CMx</name>
                            <description>ERR_CMx description</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ERR_IE</name>
                            <description>ERR_IE description</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <!--RTC_CS_TMR1-->
                <register derivedFrom="RTC_CS_TMR0">
                    <name>RTC_CS_TMR1</name>
                    <description>RTC_CS_TMR1 description</description>
                    <addressOffset>0x00000160</addressOffset>
                </register>
                <!--RTC_CS_TMR2-->
                <register derivedFrom="RTC_CS_TMR0">
                    <name>RTC_CS_TMR2</name>
                    <description>RTC_CS_TMR2 description</description>
                    <addressOffset>0x00000180</addressOffset>
                </register>
