ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/SVD/MDR1986VK01/MDR1986VK01.svd
                <!--BLDO_CTRL0-->
                <register>
                    <name>BLDO_CTRL0</name>
                    <description>BLDO_CTRL0 description</description>
                    <addressOffset>0x00000190</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>BLDO_DIS</name>
                            <description>BLDO_DIS description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BLDO_TRIM</name>
                            <description>BLDO_TRIM description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>BLDO_SIRLOW</name>
                            <description>BLDO_SIRLOW description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>BLDO_READY</name>
                            <description>BLDO_READY description</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>BLDO_ERR_CLR</name>
                            <description>BLDO_ERR_CLR description</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <!--BLDO_CTRL1-->
                <register derivedFrom="BLDO_CTRL0">
                    <name>BLDO_CTRL1</name>
                    <description>BLDO_CTRL1 description</description>
                    <addressOffset>0x00000194</addressOffset>
                </register>
                <!--BLDO_CTRL2-->
                <register derivedFrom="BLDO_CTRL0">
                    <name>BLDO_CTRL2</name>
                    <description>BLDO_CTRL2 description</description>
                    <addressOffset>0x0000019C</addressOffset>
                </register>
            </registers>
        </peripheral>
        <!--MDR_FTMODE-->
        <peripheral>
            <name>MDR_FTMODE</name>
            <description>MDR_FTMODE description</description>
            <groupName>MDR_FTMODE</groupName>
            <baseAddress>0x40003000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>KEY</name>
                    <displayName>KEY</displayName>
                    <description>KEY description</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>CONTROL</name>
                    <displayName>CONTROL</displayName>
                    <description>CONTROL description</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CAN_EN</name>
                            <description>CAN_EN description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TICKOVER_IE</name>
                            <description>TICKOVER_IE description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RESET_TIMEOUT_CNT</name>
                            <description>RESET_TIMEOUT_CNT description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CAN_RESET</name>
                            <description>CAN_RESET description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STATUS</name>
                    <displayName>STATUS</displayName>
                    <description>STATUS description</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>TICKOVER</name>
                            <description>TICKOVER description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FIRST_EVENT</name>
                            <description>FIRST_EVENT description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LAST_EVENT</name>
                            <description>LAST_EVENT description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FT_IF0</name>
                            <description>FT_IF0 description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FT_IF1</name>
                            <description>FT_IF1 description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FT_IF2</name>
                            <description>FT_IF2 description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FT_IF3</name>
                            <description>FT_IF3 description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CAN_STAT</name>
                            <description>CAN_STAT description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMEOUT</name>
                    <displayName>TIMEOUT</displayName>
                    <description>TIMEOUT description</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>TIMEOUT</name>
                            <description>TIMEOUT description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TICKCNT</name>
                    <displayName>TICKCNT</displayName>
                    <description>TICKCNT description</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>FIRSTEVENT</name>
                    <displayName>FIRSTEVENT</displayName>
                    <description>FIRSTEVENT description</description>
                    <addressOffset>0x00000014</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>LASTEVENT</name>
                    <displayName>LASTEVENT</displayName>
                    <description>LASTEVENT description</description>
                    <addressOffset>0x00000018</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TIMEOUTCNT</name>
                    <displayName>TIMEOUTCNT</displayName>
                    <description>TIMEOUTCNT description</description>
                    <addressOffset>0x0000001C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>TIMEOUTCNT</name>
                            <description>TIMEOUTCNT description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>17</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EVENT0</name>
                    <displayName>EVENT0</displayName>
                    <description>EVENT0 description</description>
                    <addressOffset>0x00000020</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>COMP_REG_ERR</name>
                            <description>COMP_REG_ERR description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>AHB_I_COMP_ERR</name>
                            <description>AHB_I_COMP_ERR description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>AHB_D_COMP_ERR</name>
                            <description>AHB_D_COMP_ERR description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>AHB_S_COMP_ERR</name>
                            <description>AHB_S_COMP_ERR description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>AHB_M_COMP_ERR</name>
                            <description>AHB_M_COMP_ERR description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>AHB_C_COMP_ERR</name>
                            <description>AHB_C_COMP_ERR description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>AHB_EEPROM_COMP_ERR_0</name>
                            <description>AHB_EEPROM_COMP_ERR_0 description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EEPROM_COMP_REG_ERR_0</name>
                            <description>EEPROM_COMP_REG_ERR_0 description</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>AHB_EEPROM_COMP_ERR_1</name>
                            <description>AHB_EEPROM_COMP_ERR_1 description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EEPROM_COMP_REG_ERR_1</name>
                            <description>EEPROM_COMP_REG_ERR_1 description</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>AHB_SRAMD_COMP_ERR_0</name>
                            <description>AHB_SRAMD_COMP_ERR_0 description</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SRAMD_COMP_REG_ERR_0</name>
                            <description>SRAMD_COMP_REG_ERR_0 description</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>AHB_SRAMD_COMP_ERR_1</name>
                            <description>AHB_SRAMD_COMP_ERR_1 description</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SRAMD_COMP_REG_ERR_1</name>
                            <description>SRAMD_COMP_REG_ERR_1 description</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>AHB_SRAMC_COMP_ERR_0</name>
                            <description>AHB_SRAMC_COMP_ERR_0 description</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SRAMC_COMP_REG_ERR_0</name>
                            <description>SRAMC_COMP_REG_ERR_0 description</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>AHB_SRAMC_COMP_ERR_1</name>
                            <description>AHB_SRAMC_COMP_ERR_1 description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SRAMC_COMP_REG_ERR_1</name>
                            <description>SRAMC_COMP_REG_ERR_1 description</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
