ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/SVD/MDR1986VK01/MDR1986VK01.svd
                <register>
                    <name>EVENT1</name>
                    <displayName>EVENT1</displayName>
                    <description>EVENT1 description</description>
                    <addressOffset>0x00000024</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>ECCERRI_0</name>
                            <description>ECCERRI_0 description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ECCERRD_0</name>
                            <description>ECCERRD_0 description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ECCERRS_0</name>
                            <description>ECCERRS_0 description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ECCERRM_0</name>
                            <description>ECCERRM_0 description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ECCERRC_0</name>
                            <description>ECCERRC_0 description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ECCERRI_1</name>
                            <description>ECCERRI_1 description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ECCERRD_1</name>
                            <description>ECCERRD_1 description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ECCERRS_1</name>
                            <description>ECCERRS_1 description</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ECCERRM_1</name>
                            <description>ECCERRM_1 description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ECCERRC_1</name>
                            <description>ECCERRC_1 description</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ECCERR_ROM</name>
                            <description>ECCERR_ROM description</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ECCERR0_EEPROM_0</name>
                            <description>ECCERR0_EEPROM_0 description</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ECCERR1_EEPROM_0</name>
                            <description>ECCERR1_EEPROM_0 description</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ECCERR0_EEPROM_1</name>
                            <description>ECCERR0_EEPROM_1 description</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ECCERR1_EEPROM_1</name>
                            <description>ECCERR1_EEPROM_1 description</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ECCERR0_RAMD_0</name>
                            <description>ECCERR0_RAMD_0 description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ECCERR1_RAMD_0</name>
                            <description>ECCERR1_RAMD_0 description</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ECCERR0_RAMD_1</name>
                            <description>ECCERR0_RAMD_1 description</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ECCERR1_RAMD1</name>
                            <description>ECCERR1_RAMD1 description</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ECCERR0_RAMC0</name>
                            <description>ECCERR0_RAMC0 description</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ECCERR1_RAMC1</name>
                            <description>ECCERR1_RAMC1 description</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ECCERR0_RAMC1</name>
                            <description>ECCERR0_RAMC1 description</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ECCERR1_RAMC0</name>
                            <description>ECCERR1_RAMC0 description</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ECCERR_EXTBUS</name>
                            <description>ECCERR_EXTBUS description</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ECCERR_EXTBUS2</name>
                            <description>ECCERR_EXTBUS2 description</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EVENT2</name>
                    <displayName>EVENT2</displayName>
                    <description>EVENT2 description</description>
                    <addressOffset>0x00000028</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>EVENT3</name>
                    <displayName>EVENT3</displayName>
                    <description>EVENT3 description</description>
                    <addressOffset>0x0000002C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>EVENT4</name>
                    <displayName>EVENT4</displayName>
                    <description>EVENT4 description</description>
                    <addressOffset>0x00000030</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>EVENT5</name>
                    <displayName>EVENT5</displayName>
                    <description>EVENT5 description</description>
                    <addressOffset>0x00000034</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>EVENT6</name>
                    <displayName>EVENT6</displayName>
                    <description>EVENT6 description</description>
                    <addressOffset>0x00000038</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>EVENT7</name>
                    <displayName>EVENT7</displayName>
                    <description>EVENT7 description</description>
                    <addressOffset>0x0000003C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>EVENT8</name>
                    <displayName>EVENT8</displayName>
                    <description>EVENT8 description</description>
                    <addressOffset>0x00000040</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>EVENT9</name>
                    <displayName>EVENT9</displayName>
                    <description>EVENT9 description</description>
                    <addressOffset>0x00000044</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>EVENT10</name>
                    <displayName>EVENT10</displayName>
                    <description>EVENT10 description</description>
                    <addressOffset>0x00000048</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>EVENT11</name>
                    <displayName>EVENT11</displayName>
                    <description>EVENT11 description</description>
                    <addressOffset>0x0000004C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>EVENT12</name>
                    <displayName>EVENT12</displayName>
                    <description>EVENT12 description</description>
                    <addressOffset>0x00000050</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RESET_EVENT0</name>
                    <displayName>RESET_EVENT0</displayName>
                    <description>RESET_EVENT0 description</description>
                    <addressOffset>0x00000054</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RESET_EVENT1</name>
                    <displayName>RESET_EVENT1</displayName>
                    <description>RESET_EVENT1 description</description>
                    <addressOffset>0x00000058</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RESET_EVENT2</name>
                    <displayName>RESET_EVENT2</displayName>
                    <description>RESET_EVENT2 description</description>
                    <addressOffset>0x0000005C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RESET_EVENT3</name>
                    <displayName>RESET_EVENT3</displayName>
                    <description>RESET_EVENT3 description</description>
                    <addressOffset>0x00000060</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RESET_EVENT4</name>
                    <displayName>RESET_EVENT4</displayName>
                    <description>RESET_EVENT4 description</description>
                    <addressOffset>0x00000064</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>IE_EVENT5</name>
                    <displayName>IE_EVENT5</displayName>
                    <description>IE_EVENT5 description</description>
                    <addressOffset>0x00000068</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>IE_EVENT6</name>
                    <displayName>IE_EVENT6</displayName>
                    <description>IE_EVENT6 description</description>
                    <addressOffset>0x0000006C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>IE_EVENT7</name>
                    <displayName>IE_EVENT7</displayName>
                    <description>IE_EVENT7 description</description>
                    <addressOffset>0x00000070</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>IE_EVENT8</name>
                    <displayName>IE_EVENT8</displayName>
                    <description>IE_EVENT8 description</description>
                    <addressOffset>0x00000074</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>IE_EVENT9</name>
                    <displayName>IE_EVENT9</displayName>
                    <description>IE_EVENT9 description</description>
                    <addressOffset>0x00000078</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>IE_EVENT10</name>
                    <displayName>IE_EVENT10</displayName>
                    <description>IE_EVENT10 description</description>
                    <addressOffset>0x0000007C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>IE_EVENT11</name>
                    <displayName>IE_EVENT11</displayName>
                    <description>IE_EVENT11 description</description>
                    <addressOffset>0x00000080</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>IE_EVENT12</name>
                    <displayName>IE_EVENT12</displayName>
                    <description>IE_EVENT12 description</description>
                    <addressOffset>0x00000084</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>STAT0</name>
                    <displayName>STAT0</displayName>
                    <description>STAT0 description</description>
                    <addressOffset>0x00000088</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>STAT1</name>
                    <displayName>STAT1</displayName>
                    <description>STAT1 description</description>
                    <addressOffset>0x0000008C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
