ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/SVD/MDR1986VK01/MDR1986VK01.svd
            </registers>
        </peripheral>
        <!--MDR_WDT-->
        <peripheral>
            <name>MDR_WDT</name>
            <description>MDR_WDT description</description>
            <groupName>MDR_WDT</groupName>
            <baseAddress>0x40004000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>KEY</name>
                    <displayName>KEY</displayName>
                    <description>KEY description</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>PRL</name>
                    <displayName>PRL</displayName>
                    <description>PRL description</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>EN</name>
                    <displayName>EN</displayName>
                    <description>EN description</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>CNT</name>
                    <displayName>CNT</displayName>
                    <description>CNT description</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
            </registers>
        </peripheral>
        <!--MDR_FLASH-->
        <peripheral>
            <name>MDR_FLASH</name>
            <description>MDR_FLASH description</description>
            <groupName>MDR_FLASH</groupName>
            <baseAddress>0x40006000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>KEY</name>
                    <displayName>KEY</displayName>
                    <description>KEY description</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>CNTR</name>
                    <displayName>CNTR</displayName>
                    <description>CNTR description</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>FLASH5_CR</name>
                            <description>Enable FLASH5 control from control registers</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FLASH4_CR</name>
                            <description>Enable FLASH4 control from control registers</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FLASH3_CR</name>
                            <description>Enable FLASH3 control from control registers</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FLASH2_CR</name>
                            <description>Enable FLASH2 control from control registers</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FLASH1_CR</name>
                            <description>Enable FLASH1 control from control registers</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FLASH0_CR</name>
                            <description>Enable FLASH0 control from control registers</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ERASE_DONE</name>
                            <description>FLASH erase completion flag</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>rdata_ready</name>
                            <description>Enable bit for writing read data to registers</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IFREN</name>
                            <description>Memory type selection bit when accessing memory</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NVSTR</name>
                            <description></description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PROG</name>
                            <description>Memory programming signal setting bit in register access mode</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MAS1</name>
                            <description>Bit for setting the general memory erase signal in the register access mode</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ERASE</name>
                            <description>Memory erase signal setting bit in register access mode</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>YE</name>
                            <description>Bit for setting the signal to enable the high part of the address in the register access mode</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>XE</name>
                            <description>Bit of formation of the signal of permission of the lower part of the address in the mode of register access</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SE</name>
                            <description>Bits of signal formation of access to EEPROM memory blocks</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>TMR</name>
                            <description>Test mode signal generation bit for EEPROM blocks</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ERASE_START</name>
                            <description>Beginning of the FLASH erasure procedure, which opens access to FLASH</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BRKTHRU_DONE</name>
                            <description>Flag of completion of the procedure for accessing a private part of memory</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BRKTHRU_START</name>
                            <description>The beginning of the procedure for accessing a private part of memory. Self-cleaning bit</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MODE</name>
                            <description>FLASH access mode. 0 - system access mode; 1 - register-side access mode</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WAIT</name>
                            <description>Number of wait cycles when accessing memory</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADR</name>
                    <displayName>ADR</displayName>
                    <description>ADR description</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>XADR</name>
                            <description>XADR[8:0] = page[5:0], row[2:0]</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>9</bitWidth>
                        </field>
                        <field>
                            <name>YADR</name>
                            <description>col[6:0]</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WDATA3</name>
                    <displayName>WDATA3</displayName>
                    <description>WDATA3 description</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>WDATA2</name>
                    <displayName>WDATA2</displayName>
                    <description>WDATA2 description</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>WDATA1</name>
                    <displayName>WDATA1</displayName>
                    <description>WDATA1 description</description>
                    <addressOffset>0x00000014</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>WDATA0</name>
                    <displayName>WDATA0</displayName>
                    <description>WDATA0 description</description>
                    <addressOffset>0x00000018</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>WECC0</name>
                    <displayName>WECC0</displayName>
                    <description>WECC0 description</description>
                    <addressOffset>0x0000001C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>WECC1</name>
                    <displayName>WECC1</displayName>
                    <description>WECC1 description</description>
                    <addressOffset>0x00000020</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RDATA3</name>
                    <displayName>RDATA3</displayName>
                    <description>RDATA3 description</description>
                    <addressOffset>0x00000024</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RDATA2</name>
                    <displayName>RDATA2</displayName>
                    <description>RDATA2 description</description>
                    <addressOffset>0x00000028</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RDATA1</name>
                    <displayName>RDATA1</displayName>
                    <description>RDATA1 description</description>
                    <addressOffset>0x0000002C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RDATA0</name>
                    <displayName>RDATA0</displayName>
                    <description>RDATA0 description</description>
                    <addressOffset>0x00000030</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RECC0</name>
                    <displayName>RECC0</displayName>
                    <description>RECC0 description</description>
                    <addressOffset>0x00000034</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RECC1</name>
                    <displayName>RECC1</displayName>
                    <description>RECC1 description</description>
                    <addressOffset>0x00000038</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ECCCS</name>
                    <displayName>ECCCS</displayName>
                    <description>ECCCS description</description>
                    <addressOffset>0x0000003C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>SEEC_CNT</name>
                            <description>Single error counter</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>DEEC_CNT</name>
                            <description>Double error counter</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>CLR_DCNT</name>
                            <description>Single error counter reset bit</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CLR_SCNT</name>
                            <description>Single error counter reset bit; Write 1 to reset the SECC_CNT counter</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FIX_DECC</name>
                            <description>Latch enable bit in the address and address data registers of the last error on a double error;0 - allowed</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FIX_SECC</name>
                            <description>Latch enable bit in the address and address data registers of the last error on a single error;0 - allowed</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DECC_IE</name>
                            <description>ECC double error interrupt enable bit</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SECC_IE</name>
                            <description>ECC single error interrupt enable bit</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DECC</name>
                            <description>Double error flag;Cleared by writing 1</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SECC</name>
                            <description>Single error flag;Cleared by writing 1</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECCADR</name>
                    <displayName>ECCADR</displayName>
                    <description>ECCADR description</description>
                    <addressOffset>0x00000040</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ECCDATA</name>
                    <displayName>ECCDATA</displayName>
                    <description>ECCDATA description</description>
                    <addressOffset>0x00000044</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ECCECC</name>
                    <displayName>ECCECC</displayName>
                    <description>ECCECC description</description>
                    <addressOffset>0x00000048</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>BLOCK</name>
                    <displayName>BLOCK</displayName>
                    <description>Writing the value 32'hb3c3b3c3 enables the process of opening a closed memory area</description>
                    <addressOffset>0x0000004C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
