ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/SVD/MDR1986VK01/MDR1986VK01.svd
            </registers>
        </peripheral>
        <!--MDR_ROM-->
        <peripheral>
            <name>MDR_ROM</name>
            <description>MDR_ROM description</description>
            <groupName>MDR_ROM</groupName>
            <baseAddress>0x40005000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>KEY</name>
                    <displayName>KEY</displayName>
                    <description>KEY description</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ECCCS</name>
                    <displayName>ECCCS</displayName>
                    <description>ECCCS description</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ECCADR</name>
                    <displayName>ECCADR</displayName>
                    <description>ECCADR description</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ECCDATA</name>
                    <displayName>ECCDATA</displayName>
                    <description>ECCDATA description</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ECCECC</name>
                    <displayName>ECCECC</displayName>
                    <description>ECCECC description</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TEST_TUNING</name>
                    <displayName>TEST_TUNING</displayName>
                    <description>TEST_TUNING description</description>
                    <addressOffset>0x00000014</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
            </registers>
        </peripheral>
        <!--MDR_RAMC0-->
        <peripheral>
            <name>MDR_RAMC0</name>
            <description>MDR_RAMC0 description</description>
            <groupName>MDR_RAM</groupName>
            <baseAddress>0x40008000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>KEY</name>
                    <displayName>KEY</displayName>
                    <description>KEY description</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ECCCS</name>
                    <displayName>ECCCS</displayName>
                    <description>ECCCS description</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ECCADR</name>
                    <displayName>ECCADR</displayName>
                    <description>ECCADR description</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ECCDATA</name>
                    <displayName>ECCDATA</displayName>
                    <description>ECCDATA description</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ECCECC</name>
                    <displayName>ECCECC</displayName>
                    <description>ECCECC description</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TEST_TUNING</name>
                    <displayName>TEST_TUNING</displayName>
                    <description>TEST_TUNING description</description>
                    <addressOffset>0x00000014</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
            </registers>
        </peripheral>
        <!--MDR_RAMC1-->
        <peripheral>
            <name>MDR_RAMC1</name>
            <description>MDR_RAMC1 description</description>
            <groupName>MDR_RAM</groupName>
            <baseAddress>0x40009000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>KEY</name>
                    <displayName>KEY</displayName>
                    <description>KEY description</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ECCCS</name>
                    <displayName>ECCCS</displayName>
                    <description>ECCCS description</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ECCADR</name>
                    <displayName>ECCADR</displayName>
                    <description>ECCADR description</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ECCDATA</name>
                    <displayName>ECCDATA</displayName>
                    <description>ECCDATA description</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ECCECC</name>
                    <displayName>ECCECC</displayName>
                    <description>ECCECC description</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TEST_TUNING</name>
                    <displayName>TEST_TUNING</displayName>
                    <description>TEST_TUNING description</description>
                    <addressOffset>0x00000014</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
