ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/SVD/MDR1986VK01/MDR1986VK01.svd
            </registers>
        </peripheral>
        <!--MDR_RAMD0-->
        <peripheral>
            <name>MDR_RAMD0</name>
            <description>MDR_RAMD0 description</description>
            <groupName>MDR_RAM</groupName>
            <baseAddress>0x4000A000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>KEY</name>
                    <displayName>KEY</displayName>
                    <description>KEY description</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ECCCS</name>
                    <displayName>ECCCS</displayName>
                    <description>ECCCS description</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ECCADR</name>
                    <displayName>ECCADR</displayName>
                    <description>ECCADR description</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ECCDATA</name>
                    <displayName>ECCDATA</displayName>
                    <description>ECCDATA description</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ECCECC</name>
                    <displayName>ECCECC</displayName>
                    <description>ECCECC description</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TEST_TUNING</name>
                    <displayName>TEST_TUNING</displayName>
                    <description>TEST_TUNING description</description>
                    <addressOffset>0x00000014</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
            </registers>
        </peripheral>
        <!--MDR_RAMD1-->
        <peripheral>
            <name>MDR_RAMD1</name>
            <description>MDR_RAMD1 description</description>
            <groupName>MDR_RAM</groupName>
            <baseAddress>0x4000B000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>KEY</name>
                    <displayName>KEY</displayName>
                    <description>KEY description</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ECCCS</name>
                    <displayName>ECCCS</displayName>
                    <description>ECCCS description</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ECCADR</name>
                    <displayName>ECCADR</displayName>
                    <description>ECCADR description</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ECCDATA</name>
                    <displayName>ECCDATA</displayName>
                    <description>ECCDATA description</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ECCECC</name>
                    <displayName>ECCECC</displayName>
                    <description>ECCECC description</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TEST_TUNING</name>
                    <displayName>TEST_TUNING</displayName>
                    <description>TEST_TUNING description</description>
                    <addressOffset>0x00000014</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
            </registers>
        </peripheral>
        <!--MDR_EBC-->
        <peripheral>
            <name>MDR_EBC</name>
            <description>MDR_EBC description</description>
            <groupName>MDR_EBC</groupName>
            <baseAddress>0x4000C000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>RGN0_CNTRL</name>
                    <displayName>RGN0_CNTRL</displayName>
                    <description>RGN0_CNTRL description</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RGN0_ECCBASE</name>
                    <displayName>RGN0_ECCBASE</displayName>
                    <description>RGN0_ECCBASE description</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RGN0_ECCS</name>
                    <displayName>RGN0_ECCS</displayName>
                    <description>RGN0_ECCS description</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RGN0_STATE</name>
                    <displayName>RGN0_STATE</displayName>
                    <description>RGN0_STATE description</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RGN1_CNTRL</name>
                    <displayName>RGN1_CNTRL</displayName>
                    <description>RGN1_CNTRL description</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RGN1_ECCBASE</name>
                    <displayName>RGN1_ECCBASE</displayName>
                    <description>RGN1_ECCBASE description</description>
                    <addressOffset>0x00000014</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RGN1_ECCS</name>
                    <displayName>RGN1_ECCS</displayName>
                    <description>RGN1_ECCS description</description>
                    <addressOffset>0x00000018</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RGN1_STATE</name>
                    <displayName>RGN1_STATE</displayName>
                    <description>RGN1_STATE description</description>
                    <addressOffset>0x0000001C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RGN2_CNTRL</name>
                    <displayName>RGN2_CNTRL</displayName>
                    <description>RGN2_CNTRL description</description>
                    <addressOffset>0x00000020</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RGN2_ECCBASE</name>
                    <displayName>RGN2_ECCBASE</displayName>
                    <description>RGN2_ECCBASE description</description>
                    <addressOffset>0x00000024</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RGN2_ECCS</name>
                    <displayName>RGN2_ECCS</displayName>
                    <description>RGN2_ECCS description</description>
                    <addressOffset>0x00000028</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RGN2_STATE</name>
                    <displayName>RGN2_STATE</displayName>
                    <description>RGN2_STATE description</description>
                    <addressOffset>0x0000002C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RGN3_CNTRL</name>
                    <displayName>RGN3_CNTRL</displayName>
                    <description>RGN3_CNTRL description</description>
                    <addressOffset>0x00000030</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RGN3_ECCBASE</name>
                    <displayName>RGN3_ECCBASE</displayName>
                    <description>RGN3_ECCBASE description</description>
                    <addressOffset>0x00000034</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RGN3_ECCS</name>
                    <displayName>RGN3_ECCS</displayName>
                    <description>RGN3_ECCS description</description>
                    <addressOffset>0x00000038</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RGN3_STATE</name>
                    <displayName>RGN3_STATE</displayName>
                    <description>RGN3_STATE description</description>
                    <addressOffset>0x0000003C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RGN4_CNTRL</name>
                    <displayName>RGN4_CNTRL</displayName>
                    <description>RGN4_CNTRL description</description>
                    <addressOffset>0x00000040</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RGN4_ECCBASE</name>
                    <displayName>RGN4_ECCBASE</displayName>
                    <description>RGN4_ECCBASE description</description>
                    <addressOffset>0x00000044</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RGN4_ECCS</name>
                    <displayName>RGN4_ECCS</displayName>
                    <description>RGN4_ECCS description</description>
                    <addressOffset>0x00000048</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RGN4_STATE</name>
                    <displayName>RGN4_STATE</displayName>
                    <description>RGN4_STATE description</description>
                    <addressOffset>0x0000004C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RGN5_CNTRL</name>
                    <displayName>RGN5_CNTRL</displayName>
                    <description>RGN5_CNTRL description</description>
                    <addressOffset>0x00000050</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RGN5_ECCBASE</name>
                    <displayName>RGN5_ECCBASE</displayName>
                    <description>RGN5_ECCBASE description</description>
                    <addressOffset>0x00000054</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RGN5_ECCS</name>
                    <displayName>RGN5_ECCS</displayName>
                    <description>RGN5_ECCS description</description>
                    <addressOffset>0x00000058</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RGN5_STATE</name>
                    <displayName>RGN5_STATE</displayName>
                    <description>RGN5_STATE description</description>
                    <addressOffset>0x0000005C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RGN6_CNTRL</name>
                    <displayName>RGN6_CNTRL</displayName>
                    <description>RGN6_CNTRL description</description>
                    <addressOffset>0x00000060</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RGN6_ECCBASE</name>
                    <displayName>RGN6_ECCBASE</displayName>
                    <description>RGN6_ECCBASE description</description>
                    <addressOffset>0x00000064</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RGN6_ECCS</name>
                    <displayName>RGN6_ECCS</displayName>
                    <description>RGN6_ECCS description</description>
                    <addressOffset>0x00000068</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RGN6_STATE</name>
                    <displayName>RGN6_STATE</displayName>
                    <description>RGN6_STATE description</description>
                    <addressOffset>0x0000006C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RGN7_CNTRL</name>
                    <displayName>RGN7_CNTRL</displayName>
                    <description>RGN7_CNTRL description</description>
                    <addressOffset>0x00000070</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RGN7_ECCBASE</name>
                    <displayName>RGN7_ECCBASE</displayName>
                    <description>RGN7_ECCBASE description</description>
                    <addressOffset>0x00000074</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RGN7_ECCS</name>
                    <displayName>RGN7_ECCS</displayName>
                    <description>RGN7_ECCS description</description>
                    <addressOffset>0x00000078</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RGN7_STATE</name>
                    <displayName>RGN7_STATE</displayName>
                    <description>RGN7_STATE description</description>
                    <addressOffset>0x0000007C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>KEY</name>
                    <displayName>KEY</displayName>
                    <description>KEY description</description>
                    <addressOffset>0x00000080</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ECC_ADDR</name>
                    <displayName>ECC_ADDR</displayName>
                    <description>ECC_ADDR description</description>
                    <addressOffset>0x00000084</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ECC_DATA</name>
                    <displayName>ECC_DATA</displayName>
                    <description>ECC_DATA description</description>
                    <addressOffset>0x00000088</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ECC_ECC</name>
                    <displayName>ECC_ECC</displayName>
                    <description>ECC_ECC description</description>
                    <addressOffset>0x0000008C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>OCLK</name>
                    <displayName>OCLK</displayName>
                    <description>OCLK description</description>
                    <addressOffset>0x00000090</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
