ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/SVD/MDR1986VK01/MDR1986VK01.svd
            </registers>
        </peripheral>
        <!--MDR_CANFD-->
        <peripheral>
            <name>MDR_CANFD</name>
            <description>MDR_CANFD description</description>
            <groupName>MDR_CANFD</groupName>
            <baseAddress>0x40086000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>CONTROL</name>
                    <displayName>CONTROL</displayName>
                    <description>control Registr upravlenija</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CANFD_EN</name>
                            <description>Enable CAN FD format. Permission to work in CAN FD format</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EN</name>
                            <description>Enable. Work permit</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ENTX</name>
                            <description>Enable Transmitter. Allow packet transmission</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ENACK</name>
                            <description>Enable Acknoledge. Allow ACK to be sent in response to self packets</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SOVLFRM</name>
                            <description>Send Overload Frame. Set to inactive state by hardware.</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UPTIME</name>
                            <description>Update Time. Set to inactive state by hardware CURTIMEHo and CURTIMELo. Set to inactive state by hardware.</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RST_MAC</name>
                            <description>Reset MAC module. Reset MAC of CAN.</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>nISO</name>
                            <description>CRC calculation mode for CANFD packets. 1 - CRC calculation according to standard Bosch, 0 - CRC calculation according to standard ISO</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFG0</name>
                    <displayName>CFG0</displayName>
                    <description>Configuration register 0</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>LMSGLC</name>
                            <description>LMSGLC Enable. LMSGLC counter permission</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BOSC</name>
                            <description>BOSC Enable. BOSC counter permission</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EPSC</name>
                            <description>EPSC Enable. EPSC counter permission</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EOVLC</name>
                            <description>EOVLC Enable. EOVLC counter permission</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RECE</name>
                            <description>RECE Enable. RECE counter permission</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TECE</name>
                            <description>TECE Enable. TECE counter permission</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TSR</name>
                            <description>Timestamp Reset. Counter reset.</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>INTGRE</name>
                            <description>Integrating Enable. Wait or not 11 recessive bits after power on (CTRL.EN -> 1)</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPW</name>
                            <description>Sample Width. Bit sets the sampling mode of the bit: 0 - one point 1 - three points</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STM</name>
                            <description>Self-transmit Mode.</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TSI</name>
                            <description>Timestamp Increment. 1 - 1. 2 - 10. 4 - 100. 8 - 1000.</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFG1</name>
                    <displayName>CFG1</displayName>
                    <description>Configuration register 1</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>FPHERRCOR1</name>
                            <description>SEG1_D - First phase error compensation register (Fast Prescaler)</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>FRJW</name>
                            <description>RJW_D - Fast (Re-)Synchronization Jump Width.</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>FPHERRCOR2</name>
                            <description>SEG2_D - Second phase error compensation register (Fast Prescaler)</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>RJW</name>
                            <description>RJW_N - (Re-)Synchronization Jump Width.</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PHERRCOR1</name>
                            <description>SEG1_N - First phase error compensation register</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>PHERRCOR2</name>
                            <description>SEG2_N - Second phase error compensation register</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>PHYLDCOR</name>
                            <description>PROPSEG - Compensation of the physical delay of the line</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFG2</name>
                    <displayName>CFG2</displayName>
                    <description>Configuration register 2</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>TECWL</name>
                            <description>The level of the warning signal on reaching or exceeding the value of the TEC counter. When the value of this counter reaches or exceeds the warning level, the corresponding bit in the ST register is set and the EOVLC counter is incremented.</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>RECWL</name>
                            <description>The level of the warning signal on reaching or exceeding the value of the REC counter. When the value of this counter reaches or exceeds the warning level, the corresponding bit in the ST register is set and the EOVLC counter is incremented.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFG3</name>
                    <displayName>CFG3</displayName>
                    <description>Configuration register 3</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>TXQMMSIZE</name>
                            <description>transmitter queue maximum message size. The maximum size of transmission queue messages [0:64]. By default, the maximum is set (size only for the data field).</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>RXQMMSIZE</name>
                            <description>receiver queue maximum message size. The maximum size of receive queue messages [0:64]. By default, the maximum is set (size only for the data field).</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>TXQD</name>
                            <description>transmitter queue size. Size for all transmission queues (default = 96 messages)</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>RXQD</name>
                            <description>receiver queue size. Size for the entire receive queue (default = 96 messages)</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXFCFG</name>
                    <displayName>RXFCFG</displayName>
                    <description>receiver filters configuration. Filter configuration register for incoming messages</description>
                    <addressOffset>0x00000014</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>FM</name>
                            <description>Filter Mask. 0 - filter is off</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PRSC</name>
                    <displayName>PRSC</displayName>
                    <description>Prescaler register</description>
                    <addressOffset>0x00000018</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>BRP</name>
                            <description>Baud-Rate Prescaler.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FPRSC</name>
                    <displayName>FPRSC</displayName>
                    <description>Fast prescaler register</description>
                    <addressOffset>0x0000001C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>FBRP</name>
                            <description>Fast Baud-Rate Prescaler.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                    </fields>
                </register>
