ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/SVD/MDR1986VK01/MDR1986VK01.svd
                <register>
                    <name>ST</name>
                    <displayName>ST</displayName>
                    <description>statuses Registr statusa</description>
                    <addressOffset>0x00000020</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>RXQF</name>
                            <description>(f) Receiver queue full. There is no place to receive one more packet</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXQ0F</name>
                            <description>(f) Transmitter queue 0 is full</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXQ1F</name>
                            <description>(f) Transmitter queue 1 is full</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXQ2F</name>
                            <description>(f) Transmitter queue 2 is full</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXQ3F</name>
                            <description>(f) Transmitter queue 3 is full</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXQ0E</name>
                            <description>(f) Transmitter queue 0 is empty</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXQ1E</name>
                            <description>(f) Transmitter queue 1 is empty</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXQ2E</name>
                            <description>(f) Transmitter queue 2 is empty</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXQ3E</name>
                            <description>(f) Transmitter queue 3 is empty</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EAS</name>
                            <description>(f) CAN controller is in Error Active State</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EPS</name>
                            <description>(f) CAN controller is in Error Passive State</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BOS</name>
                            <description>(f) CAN controller is in Bus Off State</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXACT</name>
                            <description>(f) Receiving message in progress</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXACT</name>
                            <description>(f) Message transmission in progress</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DLCERR</name>
                            <description>(e) DLC error. Occurs during receiving if the DLC of the received packet is greater than the user-specified value in RXQMMSIZE. Occurs during transmission if the DLC of the transmitted packet is greater than the size specified in TXQMMSIZE.</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXML</name>
                            <description>(e) The last message in the buffer was rewritten, because the internal buffers are not empty, it was not possible to move their contents into the system memory because it was busy.</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXQOVL</name>
                            <description>(e) Receive queue is full (one or two messages are in buffers)</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TECOVL</name>
                            <description>(e) TEC counter has reached or exceeded the specified maximum</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RECOVL</name>
                            <description>(e) REC counter has reached or exceeded the specified maximum</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXFRMCMPLT</name>
                            <description>(e) Message fully accepted</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXFRMCMPLT</name>
                            <description>(e) Message transmission complete</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ARBL</name>
                            <description>(e) Loss of arbitration</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXERR</name>
                            <description>(e) Transmission error</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXERR</name>
                            <description>(e) Receive error</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BITERR</name>
                            <description>(e) Bit transfer error</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BITSTAFFERR</name>
                            <description>(e) Bit-straffing error</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ACKERR</name>
                            <description>(e) No signal acknowledge</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CRCERR</name>
                            <description>(e) CRC count error</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FRMERR</name>
                            <description>(e) Message format error on line</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MSK</name>
                    <displayName>MSK</displayName>
                    <description>Mask register</description>
                    <addressOffset>0x00000024</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>RXQF</name>
                            <description>(f) Receiver queue full. There is no place to receive one more packet</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXQ0F</name>
                            <description>(f) Transmitter queue 0 full</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXQ1F</name>
                            <description>(f) Transmitter queue 1 full</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXQ2F</name>
                            <description>(f) Transmitter queue 2 full</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXQ3F</name>
                            <description>(f) Transmitter queue 3 full</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXQ0E</name>
                            <description>(f) Transmitter queue 0 empty</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXQ1E</name>
                            <description>(f) Transmitter queue 1 empty</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXQ2E</name>
                            <description>(f) Transmitter queue 2 empty</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXQ3E</name>
                            <description>(f) Transmitter queue 3 empty</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EAS</name>
                            <description>(f) CAN controller is in error active state</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EPS</name>
                            <description>(f) CAN controller is in error passive state</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BOS</name>
                            <description>(f) CAN controller is in bus off state</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXACT</name>
                            <description>(f) Message transmission in progress idet priem soobszenija</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXACT</name>
                            <description>(f) Message transmission in progress</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DLCERR</name>
                            <description>(e) DLC error. Occurs during receiving if the DLC of the received packet is greater than the user-specified value in RXQMMSIZE. Occurs during transmission if the DLC of the transmitted packet is greater than the size specified in TXQMMSIZE.</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXML</name>
                            <description>(e) The last message in the buffer was rewritten, because the internal buffers are not empty, it was not possible to move their contents into the system memory because it was busy.i</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXQOVL</name>
                            <description>(e) Receive queue is full (one or two messages are in buffers)</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TECOVL</name>
                            <description>(e) TEC counter has reached or exceeded the specified maximum</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RECOVL</name>
                            <description>(e) REC counter has reached or exceeded the specified maximum</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXFRMCMPLT</name>
                            <description>(e) Message fully accepted</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXFRMCMPLT</name>
                            <description>(e) Message transmission complete</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ARBL</name>
                            <description>(e) Loss of arbitration</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXERR</name>
                            <description>(e) Transmission error</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXERR</name>
                            <description>(e) Receive error</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BITERR</name>
                            <description>(e) Bit transfer error</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BITSTAFFERR</name>
                            <description>(e) Bit-straffing error</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ACKERR</name>
                            <description>(e) No signal acknowledge</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CRCERR</name>
                            <description>(e) CRC count error</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FRMERR</name>
                            <description>(e) Message format error on line</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXBADDR</name>
                    <displayName>RXBADDR</displayName>
                    <description>Receiver queue base address</description>
                    <addressOffset>0x00000028</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TXBADDR0</name>
                    <displayName>TXBADDR0</displayName>
                    <description>Transmitter queue 0 base address</description>
                    <addressOffset>0x0000002C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TXBADDR1</name>
                    <displayName>TXBADDR1</displayName>
                    <description>Transmitter queue 1 base address</description>
                    <addressOffset>0x00000030</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TXBADDR2</name>
                    <displayName>TXBADDR2</displayName>
                    <description>Transmitter queue 2 base address</description>
                    <addressOffset>0x00000034</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TXBADDR3</name>
                    <displayName>TXBADDR3</displayName>
                    <description>Transmitter queue 3 base address</description>
                    <addressOffset>0x00000038</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>CURTIMEHi</name>
                    <displayName>CURTIMEHi</displayName>
                    <description>curent time counter high-order. The obsolete counter current time register, upper part</description>
                    <addressOffset>0x0000003C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>CURTIMELo</name>
                    <displayName>CURTIMELo</displayName>
                    <description>curent time counter low. The obsolete counter current time register, lower part</description>
                    <addressOffset>0x00000040</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RXQCTRL0</name>
                    <displayName>RXQCTRL0</displayName>
                    <description>Receiver queue 0 control. Receive queue 0 control and status register 0</description>
                    <addressOffset>0x00000050</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RXQCTRL1</name>
                    <displayName>RXQCTRL1</displayName>
                    <description>Receiver queue 1 control. Receive queue 0 control and status register 1</description>
                    <addressOffset>0x00000054</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TXQCTRL00</name>
                    <displayName>TXQCTRL00</displayName>
                    <description>Transmitter queue 0 control 0. Transmission queue 0 control and status register 0</description>
                    <addressOffset>0x00000058</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
