ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/SVD/MDR1986VK01/MDR1986VK01.svd
                <register>
                    <name>TXQCTRL01</name>
                    <displayName>TXQCTRL01</displayName>
                    <description>Transmitter queue 0 control 1. Transmission queue 0 control and status register 1</description>
                    <addressOffset>0x0000005C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TXQCTRL02</name>
                    <displayName>TXQCTRL02</displayName>
                    <description>Transmitter queue 0 control 2. Transmission queue 0 control and status register 2</description>
                    <addressOffset>0x00000060</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TXQCTRL10</name>
                    <displayName>TXQCTRL10</displayName>
                    <description>Transmitter queue 1 control 0. Transmission queue 1 control and status register 0</description>
                    <addressOffset>0x00000064</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TXQCTRL11</name>
                    <displayName>TXQCTRL11</displayName>
                    <description>Transmitter queue 1 control 1. Transmission queue 1 control and status register 1</description>
                    <addressOffset>0x00000068</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TXQCTRL12</name>
                    <displayName>TXQCTRL12</displayName>
                    <description>Transmitter queue 1 control 2. Transmission queue 1 control and status register 2</description>
                    <addressOffset>0x0000006C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TXQCTRL20</name>
                    <displayName>TXQCTRL20</displayName>
                    <description>Transmitter queue 2 control 0. Transmission queue 2 control and status register 0</description>
                    <addressOffset>0x00000070</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TXQCTRL21</name>
                    <displayName>TXQCTRL21</displayName>
                    <description>Transmitter queue 2 control 1. Transmission queue 2 control and status register 1</description>
                    <addressOffset>0x00000074</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TXQCTRL22</name>
                    <displayName>TXQCTRL22</displayName>
                    <description>Transmitter queue 2 control 2. Transmission queue 2 control and status register 2</description>
                    <addressOffset>0x00000078</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TXQCTRL30</name>
                    <displayName>TXQCTRL30</displayName>
                    <description>Transmitter queue 3 control 0. Transmission queue 3 control and status register 0</description>
                    <addressOffset>0x0000007C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TXQCTRL31</name>
                    <displayName>TXQCTRL31</displayName>
                    <description>Transmitter queue 3 control 1. Transmission queue 3 control and status register 1</description>
                    <addressOffset>0x00000080</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TXQCTRL32</name>
                    <displayName>TXQCTRL32</displayName>
                    <description>Transmitter queue 3 control 2. Transmission queue 3 control and status register 2</description>
                    <addressOffset>0x00000084</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TXRCTRL00</name>
                    <displayName>TXRCTRL00</displayName>
                    <description>Transmitter revoke 0 control 0. Transmit queue 0 cancel register 0</description>
                    <addressOffset>0x00000088</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TXRCTRL01</name>
                    <displayName>TXRCTRL01</displayName>
                    <description>Transmitter revoke 0 control 1. Transmit queue 0 cancel register 1</description>
                    <addressOffset>0x0000008C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TXRCTRL02</name>
                    <displayName>TXRCTRL02</displayName>
                    <description>Transmitter revoke 0 control 2. Transmit queue 0 cancel register 2</description>
                    <addressOffset>0x00000090</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TXRCTRL10</name>
                    <displayName>TXRCTRL10</displayName>
                    <description>Transmitter revoke 1 control 0. Transmit queue 1 cancel register 0</description>
                    <addressOffset>0x00000094</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TXRCTRL11</name>
                    <displayName>TXRCTRL11</displayName>
                    <description>Transmitter revoke 1 control 1. Transmit queue 1 cancel register 1</description>
                    <addressOffset>0x00000098</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TXRCTRL12</name>
                    <displayName>TXRCTRL12</displayName>
                    <description>Transmitter revoke 1 control 2. Transmit queue 1 cancel register 2</description>
                    <addressOffset>0x0000009C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TXRCTRL20</name>
                    <displayName>TXRCTRL20</displayName>
                    <description>Transmitter revoke 2 control 0. Transmit queue 2 cancel register 0</description>
                    <addressOffset>0x000000A0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TXRCTRL21</name>
                    <displayName>TXRCTRL21</displayName>
                    <description>Transmitter revoke 2 control 1. Transmit queue 2 cancel register 1</description>
                    <addressOffset>0x000000A4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TXRCTRL22</name>
                    <displayName>TXRCTRL22</displayName>
                    <description>Transmitter revoke 2 control 2. Transmit queue 2 cancel register 2</description>
                    <addressOffset>0x000000A8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TXRCTRL30</name>
                    <displayName>TXRCTRL30</displayName>
                    <description>Transmitter revoke 3 control 0. Transmit queue 3 cancel register 0</description>
                    <addressOffset>0x000000AC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TXRCTRL31</name>
                    <displayName>TXRCTRL31</displayName>
                    <description>Transmitter revoke 3 control 1. Transmit queue 3 cancel register 1</description>
                    <addressOffset>0x000000B0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TXRCTRL32</name>
                    <displayName>TXRCTRL32</displayName>
                    <description>Transmitter revoke 3 control 2. Transmit queue 3 cancel register 2</description>
                    <addressOffset>0x000000B4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RXF00</name>
                    <displayName>RXF00</displayName>
                    <description>Receiver filter 0. Incoming message filter 0 register</description>
                    <addressOffset>0x000000C0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RXF01</name>
                    <displayName>RXF01</displayName>
                    <description>Receiver filter 1. Incoming message filter 1 register</description>
                    <addressOffset>0x000000C4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RXF02</name>
                    <displayName>RXF02</displayName>
                    <description>Receiver filter 2. Incoming message filter 2 register</description>
                    <addressOffset>0x000000C8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RXF03</name>
                    <displayName>RXF03</displayName>
                    <description>Receiver filter 3. Incoming message filter 3 register</description>
                    <addressOffset>0x000000CC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RXF04</name>
                    <displayName>RXF04</displayName>
                    <description>Receiver filter 4. Incoming message filter 4 register</description>
                    <addressOffset>0x000000D0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RXF05</name>
                    <displayName>RXF05</displayName>
                    <description>Receiver filter 5. Incoming message filter 5 register</description>
                    <addressOffset>0x000000D4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RXF06</name>
                    <displayName>RXF06</displayName>
                    <description>Receiver filter 6. Incoming message filter 6 register</description>
                    <addressOffset>0x000000D8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RXF07</name>
                    <displayName>RXF07</displayName>
                    <description>Receiver filter 7. Incoming message filter 7 register</description>
                    <addressOffset>0x000000DC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RXF08</name>
                    <displayName>RXF08</displayName>
                    <description>Receiver filter 8. Incoming message filter 8 register</description>
                    <addressOffset>0x000000E0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RXF09</name>
                    <displayName>RXF09</displayName>
                    <description>Receiver filter 9. Incoming message filter 9 register</description>
                    <addressOffset>0x000000E4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RXF10</name>
                    <displayName>RXF10</displayName>
                    <description>Receiver filter 10. Incoming message filter 10 register</description>
                    <addressOffset>0x000000E8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RXF11</name>
                    <displayName>RXF11</displayName>
                    <description>Receiver filter 11. Incoming message filter 11 register</description>
                    <addressOffset>0x000000EC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RXF12</name>
                    <displayName>RXF12</displayName>
                    <description>Receiver filter 12. Incoming message filter 12 register</description>
                    <addressOffset>0x000000F0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RXF13</name>
                    <displayName>RXF13</displayName>
                    <description>Receiver filter 13. Incoming message filter 13 register</description>
                    <addressOffset>0x000000F4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RXF14</name>
                    <displayName>RXF14</displayName>
                    <description>Receiver filter 14. Incoming message filter 14 register</description>
                    <addressOffset>0x000000F8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RXF15</name>
                    <displayName>RXF15</displayName>
                    <description>Receiver filter 15. Incoming message filter 15 register</description>
                    <addressOffset>0x000000FC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RXFMSK00</name>
                    <displayName>RXFMSK00</displayName>
                    <description>Receiver filter 0 mask. Incoming message filter 0 mask register</description>
                    <addressOffset>0x00000100</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RXFMSK01</name>
                    <displayName>RXFMSK01</displayName>
                    <description>Receiver filter 1 mask. Incoming message filter 1 mask register</description>
                    <addressOffset>0x00000104</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RXFMSK02</name>
                    <displayName>RXFMSK02</displayName>
                    <description>Receiver filter 2 mask. Incoming message filter 2 mask register</description>
                    <addressOffset>0x00000108</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RXFMSK03</name>
                    <displayName>RXFMSK03</displayName>
                    <description>Receiver filter 3 mask. Incoming message filter 3 mask register</description>
                    <addressOffset>0x0000010C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RXFMSK04</name>
                    <displayName>RXFMSK04</displayName>
                    <description>Receiver filter 4 mask. Incoming message filter 4 mask register</description>
                    <addressOffset>0x00000110</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RXFMSK05</name>
                    <displayName>RXFMSK05</displayName>
                    <description>Receiver filter 5 mask. Incoming message filter 5 mask register</description>
                    <addressOffset>0x00000114</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RXFMSK06</name>
                    <displayName>RXFMSK06</displayName>
                    <description>Receiver filter 6 mask. Incoming message filter 6 mask register</description>
                    <addressOffset>0x00000118</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RXFMSK07</name>
                    <displayName>RXFMSK07</displayName>
                    <description>Receiver filter 7 mask. Incoming message filter 7 mask register</description>
                    <addressOffset>0x0000011C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RXFMSK08</name>
                    <displayName>RXFMSK08</displayName>
                    <description>Receiver filter 8 mask. Incoming message filter 8 mask register</description>
                    <addressOffset>0x00000120</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RXFMSK09</name>
                    <displayName>RXFMSK09</displayName>
                    <description>Receiver filter 9 mask. Incoming message filter 9 mask register</description>
                    <addressOffset>0x00000124</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RXFMSK10</name>
                    <displayName>RXFMSK10</displayName>
                    <description>Receiver filter 10 mask. Incoming message filter 10 mask register</description>
                    <addressOffset>0x00000128</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RXFMSK11</name>
                    <displayName>RXFMSK11</displayName>
                    <description>Receiver filter 11 mask. Incoming message filter 11 mask register</description>
                    <addressOffset>0x0000012C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RXFMSK12</name>
                    <displayName>RXFMSK12</displayName>
                    <description>Receiver filter 12 mask. Incoming message filter 12 mask register</description>
                    <addressOffset>0x00000130</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RXFMSK13</name>
                    <displayName>RXFMSK13</displayName>
                    <description>Receiver filter 13 mask. Incoming message filter 13 mask register</description>
                    <addressOffset>0x00000134</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RXFMSK14</name>
                    <displayName>RXFMSK14</displayName>
                    <description>Receiver filter 14 mask. Incoming message filter 14 mask register</description>
                    <addressOffset>0x00000138</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
