ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/SVD/MDR1986VK01/MDR1986VK01.svd
            </registers>
        </peripheral>
        <!--MDR_SSP1-->
        <peripheral>
            <name>MDR_SSP1</name>
            <description>MDR_SSP1 description</description>
            <groupName>MDR_SSPx</groupName>
            <baseAddress>0x4008A000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>CR0</name>
                    <displayName>CR0</displayName>
                    <description>CR0 description</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>DSS</name>
                            <description>DSS description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>FRF</name>
                            <description>FRF description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>SPO</name>
                            <description>SPO description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPH</name>
                            <description>SPH description</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SCR</name>
                            <description>SCR description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CR1</name>
                    <displayName>CR1</displayName>
                    <description>CR1 description</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>LBM</name>
                            <description>LBM description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SSE</name>
                            <description>SSE description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MS</name>
                            <description>MS description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SOD</name>
                            <description>SOD description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DR</name>
                    <displayName>DR</displayName>
                    <description>DR description</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>DATA description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SR</name>
                    <displayName>SR</displayName>
                    <description>SR description</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>TFE</name>
                            <description>TFE description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TNF</name>
                            <description>TNF description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RNE</name>
                            <description>RNE description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RFF</name>
                            <description>RFF description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BSY</name>
                            <description>BSY description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CPSR</name>
                    <displayName>CPSR</displayName>
                    <description>CPSR description</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>DVSR</name>
                            <description>DVSR description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IMSC</name>
                    <displayName>IMSC</displayName>
                    <description>IMSC description</description>
                    <addressOffset>0x00000014</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>RORIM</name>
                            <description>RORIM description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTIM</name>
                            <description>RTIM description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXIM</name>
                            <description>RXIM description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXIM</name>
                            <description>TXIM description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RIS</name>
                    <displayName>RIS</displayName>
                    <description>RIS description</description>
                    <addressOffset>0x00000018</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>RORRIS</name>
                            <description>RORRIS description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTRIS</name>
                            <description>RTRIS description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXRIS</name>
                            <description>RXRIS description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXRIS</name>
                            <description>TXRIS description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MIS</name>
                    <displayName>MIS</displayName>
                    <description>MIS description</description>
                    <addressOffset>0x0000001C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>RORMIS</name>
                            <description>RORMIS description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTMIS</name>
                            <description>RTMIS description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXMIS</name>
                            <description>RXMIS description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXMIS</name>
                            <description>TXMIS description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICR</name>
                    <displayName>ICR</displayName>
                    <description>ICR description</description>
                    <addressOffset>0x00000020</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>RORIC</name>
                            <description>RORIC description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTIC</name>
                            <description>RTIC description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMACR</name>
                    <displayName>DMACR</displayName>
                    <description>DMACR description</description>
                    <addressOffset>0x00000024</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>RXDMAE</name>
                            <description>RXDMAE description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXDMAE</name>
                            <description>TXDMAE description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
