ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/SVD/MDR1986VK01/MDR1986VK01.svd
            </registers>
        </peripheral>
        <!--MDR_CAN1-->
        <peripheral>
            <name>MDR_CAN1</name>
            <description>MDR_CAN1 description</description>
            <groupName>MDR_CANx</groupName>
            <baseAddress>0x4008C000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>CONTROL</name>
                    <displayName>CONTROL</displayName>
                    <description>CONTROL description</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>EN</name>
                            <description>EN description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ROM</name>
                            <description>ROM description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STM</name>
                            <description>STM description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SAP</name>
                            <description>SAP description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ROP</name>
                            <description>ROP description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STATUS</name>
                    <displayName>STATUS</displayName>
                    <description>STATUS description</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>RX_READY</name>
                            <description>RX_READY description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TX_READY</name>
                            <description>TX_READY description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ERROR_OVER</name>
                            <description>ERROR_OVER description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BIT_ERR</name>
                            <description>BIT_ERR description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BIT_STUFF_ERR</name>
                            <description>BIT_STUFF_ERR description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CRC_ERR</name>
                            <description>CRC_ERR description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FRAME_ERR</name>
                            <description>FRAME_ERR description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ACK_ERR</name>
                            <description>ACK_ERR description</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ID_LOWER</name>
                            <description>ID_LOWER description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ERRSTATUS</name>
                            <description>ERRSTATUS description</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>RXERRCNT8</name>
                            <description>RXERRCNT8 description</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXERRCNT8</name>
                            <description>TXERRCNT8 description</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXERRCNT</name>
                            <description>RXERRCNT description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>TXERRCNT</name>
                            <description>TXERRCNT description</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BITTMNG</name>
                    <displayName>BITTMNG</displayName>
                    <description>BITTMNG description</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>BRP</name>
                            <description>BRP description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>PSEG</name>
                            <description>PSEG description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SEG1</name>
                            <description>SEG1 description</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SEG2</name>
                            <description>SEG2 description</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SJW</name>
                            <description>SJW description</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>SB</name>
                            <description>SB description</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INT_EN</name>
                    <displayName>INT_EN</displayName>
                    <description>INT_EN description</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>GLB_INTEN</name>
                            <description>GLB_INTEN description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RX_INTEN</name>
                            <description>RX_INTEN description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TX_INTEN</name>
                            <description>TX_INTEN description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ERR_INTEN</name>
                            <description>ERR_INTEN description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ERRROVER_INTEN</name>
                            <description>ERRROVER_INTEN description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OVER</name>
                    <displayName>OVER</displayName>
                    <description>OVER description</description>
                    <addressOffset>0x0000001C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>ERRORMAX</name>
                            <description>ERRORMAX description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXID</name>
                    <displayName>RXID</displayName>
                    <description>RXID description</description>
                    <addressOffset>0x00000020</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>EID</name>
                            <description>EID description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>18</bitWidth>
                        </field>
                        <field>
                            <name>SID</name>
                            <description>SID description</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXDLC</name>
                    <displayName>RXDLC</displayName>
                    <description>RXDLC description</description>
                    <addressOffset>0x00000024</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>DLC</name>
                            <description>DLC description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>RTR</name>
                            <description>RTR description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>R1</name>
                            <description>R1 description</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>R0</name>
                            <description>R0 description</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SSR</name>
                            <description>SSR description</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IDE</name>
                            <description>IDE description</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXDATAL</name>
                    <displayName>RXDATAL</displayName>
                    <description>RXDATAL description</description>
                    <addressOffset>0x00000028</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RXDATAH</name>
                    <displayName>RXDATAH</displayName>
                    <description>RXDATAH description</description>
                    <addressOffset>0x0000002C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TXID</name>
                    <displayName>TXID</displayName>
                    <description>TXID description</description>
                    <addressOffset>0x00000030</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>EID</name>
                            <description>EID description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>18</bitWidth>
                        </field>
                        <field>
                            <name>SID</name>
                            <description>SID description</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXDLC</name>
                    <displayName>TXDLC</displayName>
                    <description>TXDLC description</description>
                    <addressOffset>0x00000034</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>DLC</name>
                            <description>DLC description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>RTR</name>
                            <description>RTR description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>R1</name>
                            <description>R1 description</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>R0</name>
                            <description>R0 description</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SSR</name>
                            <description>SSR description</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IDE</name>
                            <description>IDE description</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DATAL</name>
                    <displayName>DATAL</displayName>
                    <description>DATAL description</description>
                    <addressOffset>0x00000038</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>DATAH</name>
                    <displayName>DATAH</displayName>
                    <description>DATAH description</description>
                    <addressOffset>0x0000003C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>BUF_CON0</name>
                    <displayName>BUF_CON0</displayName>
                    <description>BUF_CON0 description</description>
                    <addressOffset>0x00000040</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>INT_RX</name>
                    <displayName>INT_RX</displayName>
                    <description>INT_RX description</description>
                    <addressOffset>0x000000C0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RX</name>
                    <displayName>RX</displayName>
                    <description>RX description</description>
                    <addressOffset>0x000000C4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>INT_TX</name>
                    <displayName>INT_TX</displayName>
                    <description>INT_TX description</description>
                    <addressOffset>0x000000C8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TX</name>
                    <displayName>TX</displayName>
                    <description>TX description</description>
                    <addressOffset>0x000000CC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
