ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/SVD/MDR1986VK01/MDR1986VK01.svd
                <register>
                    <name>QCLR</name>
                    <displayName>QCLR</displayName>
                    <description>QCLR description</description>
                    <addressOffset>0x00000040</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PCE</name>
                            <description>PCE description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>QPE</name>
                            <description>QPE description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>QDC</name>
                            <description>QDC description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WTO</name>
                            <description>WTO description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCU</name>
                            <description>PCU description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCO</name>
                            <description>PCO description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCR</name>
                            <description>PCR description</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCM</name>
                            <description>PCM description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SEL</name>
                            <description>SEL description</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IEL</name>
                            <description>IEL description</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UTO</name>
                            <description>UTO description</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>QFRC</name>
                    <displayName>QFRC</displayName>
                    <description>QFRC description</description>
                    <addressOffset>0x00000044</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PCE</name>
                            <description>PCE description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>QPE</name>
                            <description>QPE description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>QDC</name>
                            <description>QDC description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WTO</name>
                            <description>WTO description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCU</name>
                            <description>PCU description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCO</name>
                            <description>PCO description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCR</name>
                            <description>PCR description</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCM</name>
                            <description>PCM description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SEL</name>
                            <description>SEL description</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IEL</name>
                            <description>IEL description</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UTO</name>
                            <description>UTO description</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>QEPSTS</name>
                    <displayName>QEPSTS</displayName>
                    <description>QEPSTS description</description>
                    <addressOffset>0x00000048</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PCEF</name>
                            <description>PCEF description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FIMF</name>
                            <description>FIMF description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CDEF</name>
                            <description>CDEF description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>COEF</name>
                            <description>COEF description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>QDLF</name>
                            <description>QDLF description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>QDF</name>
                            <description>QDF description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FIDF</name>
                            <description>FIDF description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UPEVNT</name>
                            <description>UPEVNT description</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>QWDPRD</name>
                    <displayName>QWDPRD</displayName>
                    <description>QWDPRD description</description>
                    <addressOffset>0x0000004C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>QWDPRD</name>
                            <description>QWDPRD description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>QCTMR</name>
                    <displayName>QCTMR</displayName>
                    <description>QCTMR description</description>
                    <addressOffset>0x00000050</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>QCTMR</name>
                            <description>QCTMR description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>QCTMR1</name>
                    <displayName>QCTMR1</displayName>
                    <description>QCTMR1 description</description>
                    <addressOffset>0x00000054</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>QCTMR1</name>
                            <description>QCTMR1 description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>QCTMR2</name>
                    <displayName>QCTMR2</displayName>
                    <description>QCTMR2 description</description>
                    <addressOffset>0x00000058</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>QCTMR2</name>
                            <description>QCTMR2 description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>QCTMR3</name>
                    <displayName>QCTMR3</displayName>
                    <description>QCTMR3 description</description>
                    <addressOffset>0x0000005C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>QCTMR3</name>
                            <description>QCTMR3 description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>QCTMR4</name>
                    <displayName>QCTMR4</displayName>
                    <description>QCTMR4 description</description>
                    <addressOffset>0x00000060</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>QCTMR4</name>
                            <description>QCTMR4 description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>QCPRD</name>
                    <displayName>QCPRD</displayName>
                    <description>QCPRD description</description>
                    <addressOffset>0x00000064</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>QCTMR4</name>
                            <description>QCTMR4 description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>QCTMRLAT</name>
                    <displayName>QCTMRLAT</displayName>
                    <description>QCTMRLAT description</description>
                    <addressOffset>0x00000068</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>QCTMRLAT</name>
                            <description>QCTMRLAT description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>QCPRDLAT</name>
                    <displayName>QCPRDLAT</displayName>
                    <description>QCPRDLAT description</description>
                    <addressOffset>0x0000006C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>QCPRDLAT</name>
                            <description>QCPRDLAT description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
