ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/SVD/MDR1986VK01/MDR1986VK01.svd
            </registers>
        </peripheral>
        <!--MDR_PWM7-->
        <peripheral>
            <name>MDR_PWM7</name>
            <description>MDR_PWM7 description</description>
            <groupName>MDR_PWMx</groupName>
            <baseAddress>0x400A5000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>TBPRD</name>
                    <displayName>TBPRD</displayName>
                    <description>TBPRD description</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TBPHS</name>
                    <displayName>TBPHS</displayName>
                    <description>TBPHS description</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TBCTR</name>
                    <displayName>TBCTR</displayName>
                    <description>TBCTR description</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TBCTL</name>
                    <displayName>TBCTL</displayName>
                    <description>TBCTL description</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CTRMODE</name>
                            <description>CTRMODE description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PHSEN</name>
                            <description>PHSEN description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PRDLD</name>
                            <description>PRDLD description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SYNCOSEL</name>
                            <description>SYNCOSEL description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>SWFSYNC</name>
                            <description>SWFSYNC description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HSPCLKDIV</name>
                            <description>HSPCLKDIV description</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>CLDIV</name>
                            <description>CLDIV description</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>PHSDIR</name>
                            <description>PHSDIR description</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DEBUG</name>
                            <description>DEBUG description</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>SWFSYNC_MODEI</name>
                            <description>SWFSYNC_MODEI description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SWSYNC_MODEO</name>
                            <description>SWSYNC_MODEO description</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PHSDIR_EN</name>
                            <description>PHSDIR_EN description</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SYNCO_TCLK_SEL</name>
                            <description>SYNCO_TCLK_SEL description</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SYNCI_TCLK_SEL</name>
                            <description>SYNCI_TCLK_SEL description</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PRD_LOAD_MODE</name>
                            <description>PRD_LOAD_MODE description</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SOC_DELAY</name>
                            <description>SOC_DELAY description</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TBSTS</name>
                    <displayName>TBSTS</displayName>
                    <description>TBSTS description</description>
                    <addressOffset>0x00000014</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CTRDIR</name>
                            <description>CTRDIR description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SYNCI</name>
                            <description>SYNCI description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTRMAX</name>
                            <description>CTRMAX description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CMPA</name>
                    <displayName>CMPA</displayName>
                    <description>CMPA description</description>
                    <addressOffset>0x00000018</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>CMPB</name>
                    <displayName>CMPB</displayName>
                    <description>CMPB description</description>
                    <addressOffset>0x0000001C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>CMPCTL</name>
                    <displayName>CMPCTL</displayName>
                    <description>CMPCTL description</description>
                    <addressOffset>0x00000020</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>LOADAMODE</name>
                            <description>LOADAMODE description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>LOADBMODE</name>
                            <description>LOADBMODE description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>SHDWAMODE</name>
                            <description>SHDWAMODE description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SHDWBMODE</name>
                            <description>SHDWBMODE description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SHDWAFULL</name>
                            <description>SHDWAFULL description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SHDWBFULL</name>
                            <description>SHDWBFULL description</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SHDWAEMPTY</name>
                            <description>SHDWAEMPTY description</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SHDWBEMPTY</name>
                            <description>SHDWBEMPTY description</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AQCTLA</name>
                    <displayName>AQCTLA</displayName>
                    <description>AQCTLA description</description>
                    <addressOffset>0x00000028</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>EVNT4D_A_MODE</name>
                            <description>EVNT4D_A_MODE description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>EVNT4U_A_MODE</name>
                            <description>EVNT4U_A_MODE description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>EVNT3D_A_MODE</name>
                            <description>EVNT3D_A_MODE description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>EVNT3U_A_MODE</name>
                            <description>EVNT3U_A_MODE description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>EVNT2D_A_MODE</name>
                            <description>EVNT2D_A_MODE description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>EVNT2U_A_MODE</name>
                            <description>EVNT2U_A_MODE description</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>EVNT1D_A_MODE</name>
                            <description>EVNT1D_A_MODE description</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>EVNT1U_A_MODE</name>
                            <description>EVNT1U_A_MODE description</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>EVNT4_A_SEL</name>
                            <description>EVNT4_A_SEL description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>EVNT3_A_SEL</name>
                            <description>EVNT3_A_SEL description</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>EVNT2_A_SEL</name>
                            <description>EVNT2_A_SEL description</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>EVNT1_A_SEL</name>
                            <description>EVNT1_A_SEL description</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AQCTLB</name>
                    <displayName>AQCTLB</displayName>
                    <description>AQCTLB description</description>
                    <addressOffset>0x0000002C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>EVNT4D_B_MODE</name>
                            <description>EVNT4D_B_MODE description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>EVNT4U_B_MODE</name>
                            <description>EVNT4U_B_MODE description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>EVNT3D_B_MODE</name>
                            <description>EVNT3D_B_MODE description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>EVNT3U_B_MODE</name>
                            <description>EVNT3U_B_MODE description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>EVNT2D_B_MODE</name>
                            <description>EVNT2D_B_MODE description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>EVNT2U_B_MODE</name>
                            <description>EVNT2U_B_MODE description</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>EVNT1D_B_MODE</name>
                            <description>EVNT1D_B_MODE description</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>EVNT1U_B_MODE</name>
                            <description>EVNT1U_B_MODE description</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>EVNT4_B_SEL</name>
                            <description>EVNT4_B_SEL description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>EVNT3_B_SEL</name>
                            <description>EVNT3_B_SEL description</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>EVNT2_B_SEL</name>
                            <description>EVNT2_B_SEL description</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>EVNT1_B_SEL</name>
                            <description>EVNT1_B_SEL description</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AQSFRC</name>
                    <displayName>AQSFRC</displayName>
                    <description>AQSFRC description</description>
                    <addressOffset>0x00000030</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>ACTSFA</name>
                            <description>ACTSFA description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>OTSFA</name>
                            <description>OTSFA description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ACTSFB</name>
                            <description>ACTSFB description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>OTSFB</name>
                            <description>OTSFB description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RLDCSF</name>
                            <description>RLDCSF description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>I_MODEB</name>
                            <description>I_MODEB description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>I_MODEA</name>
                            <description>I_MODEA description</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AQCSFRC</name>
                    <displayName>AQCSFRC</displayName>
                    <description>AQCSFRC description</description>
                    <addressOffset>0x00000034</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CSFA</name>
                            <description>CSFA description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>CSFB</name>
                            <description>CSFB description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
