ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/SVD/MDR1986VK01/MDR1986VK01.svd
            </registers>
        </peripheral>
        <!--MDR_ADC0-->
        <peripheral>
            <name>MDR_ADC0</name>
            <description>MDR_ADC0 description</description>
            <groupName>MDR_ADCx</groupName>
            <baseAddress>0x400A7000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>ADC0CTRL</name>
                    <displayName>ADC0CTRL</displayName>
                    <description>ADC0CTRL description</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>EN</name>
                            <description>EN description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RST</name>
                            <description>RST description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>START_CONV</name>
                            <description>START_CONV description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CONV_MODE</name>
                            <description>CONV_MODE description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CONV_TRIG_CTRL</name>
                            <description>CONV_TRIG_CTRL description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>MAX_CNV</name>
                            <description>MAX_CNV description</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>ALT_DEL_CHN_P</name>
                            <description>ALT_DEL_CHN_P description</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DELAY_TIME</name>
                            <description>DELAY_TIME description</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC1CTRL</name>
                    <displayName>ADC1CTRL</displayName>
                    <description>ADC1CTRL description</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>EN</name>
                            <description>EN description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RST</name>
                            <description>RST description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BUFEN</name>
                            <description>BUFEN description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>START_CONV</name>
                            <description>START_CONV description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CONV_MODE</name>
                            <description>CONV_MODE description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CONV_TRIG_CTRL</name>
                            <description>CONV_TRIG_CTRL description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>MAX_CNV</name>
                            <description>MAX_CNV description</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>ALT_DEL_CHN_P</name>
                            <description>ALT_DEL_CHN_P description</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DELAY_TIME</name>
                            <description>DELAY_TIME description</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC0SCOPECTRL</name>
                    <displayName>ADC0SCOPECTRL</displayName>
                    <description>ADC0SCOPECTRL description</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>LOWER_SCOPE</name>
                            <description>LOWER_SCOPE description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                        <field>
                            <name>UPPER_SCOPE</name>
                            <description>UPPER_SCOPE description</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                        <field>
                            <name>SCOPE_MODE</name>
                            <description>SCOPE_MODE description</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC1SCOPECTRL</name>
                    <displayName>ADC1SCOPECTRL</displayName>
                    <description>ADC1SCOPECTRL description</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>LOWER_SCOPE</name>
                            <description>LOWER_SCOPE description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                        <field>
                            <name>UPPER_SCOPE</name>
                            <description>UPPER_SCOPE description</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                        <field>
                            <name>SCOPE_MODE</name>
                            <description>SCOPE_MODE description</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADCSYNCCTRL</name>
                    <displayName>ADCSYNCCTRL</displayName>
                    <description>ADCSYNCCTRL description</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>SYNC_MODE_A0</name>
                            <description>SYNC_MODE_A0 description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SYNC_DELAY_A0</name>
                            <description>SYNC_DELAY_A0 description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>SYNC_MODE_A1</name>
                            <description>SYNC_MODE_A1 description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SYNC_DELAY_A1</name>
                            <description>SYNC_DELAY_A1 description</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BUF_MODE_ADC</name>
                    <displayName>BUF_MODE_ADC</displayName>
                    <description>BUF_MODE_ADC description</description>
                    <addressOffset>0x00000014</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>FIFO_LIM_A0</name>
                            <description>FIFO_LIM_A0 description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>BUF_MODE_A0</name>
                            <description>BUF_MODE_A0 description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FIFO_LIM_A1</name>
                            <description>FIFO_LIM_A1 description</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>BUF_MODE_A1</name>
                            <description>BUF_MODE_A1 description</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BUF_STATE</name>
                    <displayName>BUF_STATE</displayName>
                    <description>BUF_STATE description</description>
                    <addressOffset>0x00000018</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CELL_BUSY_A0</name>
                            <description>CELL_BUSY_A0 description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>FIFO_LIM_A0</name>
                            <description>FIFO_LIM_A0 description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FIFO_NEMPTY_A0</name>
                            <description>FIFO_NEMPTY_A0 description</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FIFO_FULL_A0</name>
                            <description>FIFO_FULL_A0 description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CELL_BUSY_A1</name>
                            <description>CELL_BUSY_A1 description</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>FIFO_LIM_A1</name>
                            <description>FIFO_LIM_A1 description</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FIFO_NEMPTY_A1</name>
                            <description>FIFO_NEMPTY_A1 description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FIFO_FULL_A1</name>
                            <description>FIFO_FULL_A1 description</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SCOPE_ERR_A0</name>
                            <description>SCOPE_ERR_A0 description</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SCOPE_ERR_A1</name>
                            <description>SCOPE_ERR_A1 description</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INT_CTRL</name>
                    <displayName>INT_CTRL</displayName>
                    <description>INT_CTRL description</description>
                    <addressOffset>0x0000001C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>FIFO_FULL_ADC0</name>
                            <description>FIFO_FULL_ADC0 description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FIFO_NEMPTY_ADC0</name>
                            <description>FIFO_NEMPTY_ADC0 description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FIFO_LIM_ADC0</name>
                            <description>FIFO_LIM_ADC0 description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>END_CONV_ADC0</name>
                            <description>END_CONV_ADC0 description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FIFO_FULL_ADC1</name>
                            <description>FIFO_FULL_ADC1 description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FIFO_NEMPTY_ADC1</name>
                            <description>FIFO_NEMPTY_ADC1 description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FIFO_LIM_ADC1</name>
                            <description>FIFO_LIM_ADC1 description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>END_CONV_ADC1</name>
                            <description>END_CONV_ADC1 description</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SCOPE_ERR_ADC0</name>
                            <description>SCOPE_ERR_ADC0 description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SCOPE_ERR_ADC1</name>
                            <description>SCOPE_ERR_ADC1 description</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMARQ_CTRL_ADC</name>
                    <displayName>DMARQ_CTRL_ADC</displayName>
                    <description>DMARQ_CTRL_ADC description</description>
                    <addressOffset>0x00000020</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ANALOG_CTRL</name>
                    <displayName>ANALOG_CTRL</displayName>
                    <description>ANALOG_CTRL description</description>
                    <addressOffset>0x00000028</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>OFFSET_A0</name>
                            <description>OFFSET_A0 description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>OFFSET_MODE_A0</name>
                            <description>OFFSET_MODE_A0 description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MODE_A0</name>
                            <description>MODE_A0 description</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CALDONE_A0</name>
                            <description>CALDONE_A0 description</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OFFSET_A1</name>
                            <description>OFFSET_A1 description</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>OFFSET_MODE_A1</name>
                            <description>OFFSET_MODE_A1 description</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MODE_A1</name>
                            <description>MODE_A1 description</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CALDONE_A1</name>
                            <description>CALDONE_A1 description</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
