ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/SVD/MDR1986VK01/MDR1986VK01.svd
                <register>
                    <name>BNGP_CTRL</name>
                    <displayName>BNGP_CTRL</displayName>
                    <description>BNGP_CTRL description</description>
                    <addressOffset>0x0000002C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>IREFEN</name>
                            <description>IREFEN description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BFEN</name>
                            <description>BFEN description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>BGEN</name>
                            <description>BGEN description</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BFEXT</name>
                            <description>BFEXT description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>SWMODE</name>
                            <description>SWMODE description</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>EXTMODE</name>
                            <description>EXTMODE description</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IRECMODE</name>
                            <description>IRECMODE description</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>VRECMODE</name>
                            <description>VRECMODE description</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ZMODE</name>
                            <description>ZMODE description</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC0_CHNL_SEL0</name>
                    <displayName>ADC0_CHNL_SEL0</displayName>
                    <description>ADC0_CHNL_SEL0 description</description>
                    <addressOffset>0x00000040</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC0_CHNL_SEL1</name>
                    <displayName>ADC0_CHNL_SEL1</displayName>
                    <description>ADC0_CHNL_SEL1 description</description>
                    <addressOffset>0x00000044</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC0_CHNL_SEL2</name>
                    <displayName>ADC0_CHNL_SEL2</displayName>
                    <description>ADC0_CHNL_SEL2 description</description>
                    <addressOffset>0x00000048</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC0_CHNL_SEL3</name>
                    <displayName>ADC0_CHNL_SEL3</displayName>
                    <description>ADC0_CHNL_SEL3 description</description>
                    <addressOffset>0x0000004C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC0_CHNL_SEL4</name>
                    <displayName>ADC0_CHNL_SEL4</displayName>
                    <description>ADC0_CHNL_SEL4 description</description>
                    <addressOffset>0x00000050</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC0_CHNL_SEL5</name>
                    <displayName>ADC0_CHNL_SEL5</displayName>
                    <description>ADC0_CHNL_SEL5 description</description>
                    <addressOffset>0x00000054</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC0_CHNL_SEL6</name>
                    <displayName>ADC0_CHNL_SEL6</displayName>
                    <description>ADC0_CHNL_SEL6 description</description>
                    <addressOffset>0x00000058</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC0_CHNL_SEL7</name>
                    <displayName>ADC0_CHNL_SEL7</displayName>
                    <description>ADC0_CHNL_SEL7 description</description>
                    <addressOffset>0x0000005C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC1_CHNL_SEL0</name>
                    <displayName>ADC1_CHNL_SEL0</displayName>
                    <description>ADC1_CHNL_SEL0 description</description>
                    <addressOffset>0x00000060</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC1_CHNL_SEL1</name>
                    <displayName>ADC1_CHNL_SEL1</displayName>
                    <description>ADC1_CHNL_SEL1 description</description>
                    <addressOffset>0x00000064</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC1_CHNL_SEL2</name>
                    <displayName>ADC1_CHNL_SEL2</displayName>
                    <description>ADC1_CHNL_SEL2 description</description>
                    <addressOffset>0x00000068</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC1_CHNL_SEL3</name>
                    <displayName>ADC1_CHNL_SEL3</displayName>
                    <description>ADC1_CHNL_SEL3 description</description>
                    <addressOffset>0x0000006C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC1_CHNL_SEL4</name>
                    <displayName>ADC1_CHNL_SEL4</displayName>
                    <description>ADC1_CHNL_SEL4 description</description>
                    <addressOffset>0x00000070</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC1_CHNL_SEL5</name>
                    <displayName>ADC1_CHNL_SEL5</displayName>
                    <description>ADC1_CHNL_SEL5 description</description>
                    <addressOffset>0x00000074</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC1_CHNL_SEL6</name>
                    <displayName>ADC1_CHNL_SEL6</displayName>
                    <description>ADC1_CHNL_SEL6 description</description>
                    <addressOffset>0x00000078</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC1_CHNL_SEL7</name>
                    <displayName>ADC1_CHNL_SEL7</displayName>
                    <description>ADC1_CHNL_SEL7 description</description>
                    <addressOffset>0x0000007C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC0_RESULT0</name>
                    <displayName>ADC0_RESULT0</displayName>
                    <description>ADC0_RESULT0 description</description>
                    <addressOffset>0x00000080</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC0_RESULT1</name>
                    <displayName>ADC0_RESULT1</displayName>
                    <description>ADC0_RESULT1 description</description>
                    <addressOffset>0x00000084</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC0_RESULT2</name>
                    <displayName>ADC0_RESULT2</displayName>
                    <description>ADC0_RESULT2 description</description>
                    <addressOffset>0x00000088</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC0_RESULT3</name>
                    <displayName>ADC0_RESULT3</displayName>
                    <description>ADC0_RESULT3 description</description>
                    <addressOffset>0x0000008C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC0_RESULT4</name>
                    <displayName>ADC0_RESULT4</displayName>
                    <description>ADC0_RESULT4 description</description>
                    <addressOffset>0x00000090</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC0_RESULT5</name>
                    <displayName>ADC0_RESULT5</displayName>
                    <description>ADC0_RESULT5 description</description>
                    <addressOffset>0x00000094</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC0_RESULT6</name>
                    <displayName>ADC0_RESULT6</displayName>
                    <description>ADC0_RESULT6 description</description>
                    <addressOffset>0x00000098</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC0_RESULT7</name>
                    <displayName>ADC0_RESULT7</displayName>
                    <description>ADC0_RESULT7 description</description>
                    <addressOffset>0x0000009C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC0_RESULT8</name>
                    <displayName>ADC0_RESULT8</displayName>
                    <description>ADC0_RESULT8 description</description>
                    <addressOffset>0x000000A0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC0_RESULT9</name>
                    <displayName>ADC0_RESULT9</displayName>
                    <description>ADC0_RESULT9 description</description>
                    <addressOffset>0x000000A4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC0_RESULT10</name>
                    <displayName>ADC0_RESULT10</displayName>
                    <description>ADC0_RESULT10 description</description>
                    <addressOffset>0x000000A8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC0_RESULT11</name>
                    <displayName>ADC0_RESULT11</displayName>
                    <description>ADC0_RESULT11 description</description>
                    <addressOffset>0x000000AC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC0_RESULT12</name>
                    <displayName>ADC0_RESULT12</displayName>
                    <description>ADC0_RESULT12 description</description>
                    <addressOffset>0x000000B0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC0_RESULT13</name>
                    <displayName>ADC0_RESULT13</displayName>
                    <description>ADC0_RESULT13 description</description>
                    <addressOffset>0x000000B4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC0_RESULT14</name>
                    <displayName>ADC0_RESULT14</displayName>
                    <description>ADC0_RESULT14 description</description>
                    <addressOffset>0x000000B8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC0_RESULT15</name>
                    <displayName>ADC0_RESULT15</displayName>
                    <description>ADC0_RESULT15 description</description>
                    <addressOffset>0x000000BC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC0_RESULT16</name>
                    <displayName>ADC0_RESULT16</displayName>
                    <description>ADC0_RESULT16 description</description>
                    <addressOffset>0x000000C0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC0_RESULT17</name>
                    <displayName>ADC0_RESULT17</displayName>
                    <description>ADC0_RESULT17 description</description>
                    <addressOffset>0x000000C4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC0_RESULT18</name>
                    <displayName>ADC0_RESULT18</displayName>
                    <description>ADC0_RESULT18 description</description>
                    <addressOffset>0x000000C8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC0_RESULT19</name>
                    <displayName>ADC0_RESULT19</displayName>
                    <description>ADC0_RESULT19 description</description>
                    <addressOffset>0x000000CC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC0_RESULT20</name>
                    <displayName>ADC0_RESULT20</displayName>
                    <description>ADC0_RESULT20 description</description>
                    <addressOffset>0x000000D0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC0_RESULT21</name>
                    <displayName>ADC0_RESULT21</displayName>
                    <description>ADC0_RESULT21 description</description>
                    <addressOffset>0x000000D4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC0_RESULT22</name>
                    <displayName>ADC0_RESULT22</displayName>
                    <description>ADC0_RESULT22 description</description>
                    <addressOffset>0x000000D8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC0_RESULT23</name>
                    <displayName>ADC0_RESULT23</displayName>
                    <description>ADC0_RESULT23 description</description>
                    <addressOffset>0x000000DC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC0_RESULT24</name>
                    <displayName>ADC0_RESULT24</displayName>
                    <description>ADC0_RESULT24 description</description>
                    <addressOffset>0x000000E0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC0_RESULT25</name>
                    <displayName>ADC0_RESULT25</displayName>
                    <description>ADC0_RESULT25 description</description>
                    <addressOffset>0x000000E4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC0_RESULT26</name>
                    <displayName>ADC0_RESULT26</displayName>
                    <description>ADC0_RESULT26 description</description>
                    <addressOffset>0x000000E8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC0_RESULT27</name>
                    <displayName>ADC0_RESULT27</displayName>
                    <description>ADC0_RESULT27 description</description>
                    <addressOffset>0x000000EC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC0_RESULT28</name>
                    <displayName>ADC0_RESULT28</displayName>
                    <description>ADC0_RESULT28 description</description>
                    <addressOffset>0x000000F0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC0_RESULT29</name>
                    <displayName>ADC0_RESULT29</displayName>
                    <description>ADC0_RESULT29 description</description>
                    <addressOffset>0x000000F4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC0_RESULT30</name>
                    <displayName>ADC0_RESULT30</displayName>
                    <description>ADC0_RESULT30 description</description>
                    <addressOffset>0x000000F8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC0_RESULT31</name>
                    <displayName>ADC0_RESULT31</displayName>
                    <description>ADC0_RESULT31 description</description>
                    <addressOffset>0x000000FC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC1_RESULT0</name>
                    <displayName>ADC1_RESULT0</displayName>
                    <description>ADC1_RESULT0 description</description>
                    <addressOffset>0x00000100</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC1_RESULT1</name>
                    <displayName>ADC1_RESULT1</displayName>
                    <description>ADC1_RESULT1 description</description>
                    <addressOffset>0x00000104</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
