ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/SVD/MDR1986VK01/MDR1986VK01.svd
                <register>
                    <name>ADC1_RESULT13</name>
                    <displayName>ADC1_RESULT13</displayName>
                    <description>ADC1_RESULT13 description</description>
                    <addressOffset>0x00000134</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC1_RESULT14</name>
                    <displayName>ADC1_RESULT14</displayName>
                    <description>ADC1_RESULT14 description</description>
                    <addressOffset>0x00000138</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC1_RESULT15</name>
                    <displayName>ADC1_RESULT15</displayName>
                    <description>ADC1_RESULT15 description</description>
                    <addressOffset>0x0000013C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC1_RESULT16</name>
                    <displayName>ADC1_RESULT16</displayName>
                    <description>ADC1_RESULT16 description</description>
                    <addressOffset>0x00000140</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC1_RESULT17</name>
                    <displayName>ADC1_RESULT17</displayName>
                    <description>ADC1_RESULT17 description</description>
                    <addressOffset>0x00000144</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC1_RESULT18</name>
                    <displayName>ADC1_RESULT18</displayName>
                    <description>ADC1_RESULT18 description</description>
                    <addressOffset>0x00000148</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC1_RESULT19</name>
                    <displayName>ADC1_RESULT19</displayName>
                    <description>ADC1_RESULT19 description</description>
                    <addressOffset>0x0000014C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC1_RESULT20</name>
                    <displayName>ADC1_RESULT20</displayName>
                    <description>ADC1_RESULT20 description</description>
                    <addressOffset>0x00000150</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC1_RESULT21</name>
                    <displayName>ADC1_RESULT21</displayName>
                    <description>ADC1_RESULT21 description</description>
                    <addressOffset>0x00000154</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC1_RESULT22</name>
                    <displayName>ADC1_RESULT22</displayName>
                    <description>ADC1_RESULT22 description</description>
                    <addressOffset>0x00000158</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC1_RESULT23</name>
                    <displayName>ADC1_RESULT23</displayName>
                    <description>ADC1_RESULT23 description</description>
                    <addressOffset>0x0000015C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC1_RESULT24</name>
                    <displayName>ADC1_RESULT24</displayName>
                    <description>ADC1_RESULT24 description</description>
                    <addressOffset>0x00000160</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC1_RESULT25</name>
                    <displayName>ADC1_RESULT25</displayName>
                    <description>ADC1_RESULT25 description</description>
                    <addressOffset>0x00000164</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC1_RESULT26</name>
                    <displayName>ADC1_RESULT26</displayName>
                    <description>ADC1_RESULT26 description</description>
                    <addressOffset>0x00000168</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC1_RESULT27</name>
                    <displayName>ADC1_RESULT27</displayName>
                    <description>ADC1_RESULT27 description</description>
                    <addressOffset>0x0000016C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC1_RESULT28</name>
                    <displayName>ADC1_RESULT28</displayName>
                    <description>ADC1_RESULT28 description</description>
                    <addressOffset>0x00000170</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC1_RESULT29</name>
                    <displayName>ADC1_RESULT29</displayName>
                    <description>ADC1_RESULT29 description</description>
                    <addressOffset>0x00000174</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC1_RESULT30</name>
                    <displayName>ADC1_RESULT30</displayName>
                    <description>ADC1_RESULT30 description</description>
                    <addressOffset>0x00000178</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>ADC1_RESULT31</name>
                    <displayName>ADC1_RESULT31</displayName>
                    <description>ADC1_RESULT31 description</description>
                    <addressOffset>0x0000017C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
