ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/SVD/MDR1986VK01/MDR1986VK01.svd
            </registers>
        </peripheral>
        <!--MDR_COMP1-->
        <peripheral>
            <name>MDR_COMP1</name>
            <description>MDR_COMP1 description</description>
            <groupName>MDR_COMPx</groupName>
            <baseAddress>0x400AF000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>CNTR</name>
                    <displayName>CNTR</displayName>
                    <description>CNTR description</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PE</name>
                            <description>PE description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IE</name>
                            <description>IE description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ON</name>
                            <description>ON description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>INV</name>
                            <description>INV description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SELN</name>
                            <description>SELN description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>SELP</name>
                            <description>SELP description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>CLREN</name>
                            <description>CLREN description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EVNT</name>
                    <displayName>EVNT</displayName>
                    <description>EVNT description</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>RES_I</name>
                            <description>RES_I description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RES_IS</name>
                            <description>RES_IS description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RES_IS2</name>
                            <description>RES_IS2 description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RST</name>
                            <description>RST description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <!--MDR_COMP2-->
        <peripheral>
            <name>MDR_COMP2</name>
            <description>MDR_COMP2 description</description>
            <groupName>MDR_COMPx</groupName>
            <baseAddress>0x400B0000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>CNTR</name>
                    <displayName>CNTR</displayName>
                    <description>CNTR description</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PE</name>
                            <description>PE description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IE</name>
                            <description>IE description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ON</name>
                            <description>ON description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>INV</name>
                            <description>INV description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SELN</name>
                            <description>SELN description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>SELP</name>
                            <description>SELP description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>CLREN</name>
                            <description>CLREN description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EVNT</name>
                    <displayName>EVNT</displayName>
                    <description>EVNT description</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>RES_I</name>
                            <description>RES_I description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RES_IS</name>
                            <description>RES_IS description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RES_IS2</name>
                            <description>RES_IS2 description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RST</name>
                            <description>RST description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
