ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/SVD/MDR1986VK01/MDR1986VK01.svd
            </registers>
        </peripheral>
        <!--MDR_CORDIC-->
        <peripheral>
            <name>MDR_CORDIC</name>
            <description>MDR_CORDIC description</description>
            <groupName>MDR_CORDIC</groupName>
            <baseAddress>0x400B3000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>CTRL</name>
                    <displayName>CTRL</displayName>
                    <description>Module control register</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>IN_MODE</name>
                            <description>Rotation mode: 0 - Rotate input vector (x;y) by angle alpha. The output is new, rotated vector (x;y), angle alpha is 1 - Rotate input vector (x;y) to the X-axis. The output is the original angle of the vector alpha, and the length of the original vector in the x coordinate (deformed value)</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IN_FORMAT</name>
                            <description>Working data format: 000 - 32 bit, floating point; 001 - 16 bit, floating point; 010 - 32 bit, integer mode</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>CRD_EN</name>
                            <description>Enabling the module: 1 - turn on the module; 0 - turn off the module. Enabling is controlled by bit CRD_RDY (see status register CRD_STATUS)</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IN_LVL_VAL</name>
                            <description>The fill level of the input FIFO for generating the IN_FIFO_LVL signal (see CRD_STATUS status register). Value range [0:31]</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>OUT_LVL_VAL</name>
                            <description>The fill level of the output FIFO for generating the OUT_FIFO_LVL signal (see CRD_STATUS status register). Value range [0:31]</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STATUS</name>
                    <displayName>STATUS</displayName>
                    <description>Module status register</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CRD_RDY</name>
                            <description>Module readiness for work: 0 - The module is not ready for operation, it is turned off 1 - The module is ready for operation, it is turned on</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IN_PRGR</name>
                            <description>The flag of the presence of data in processing, this flag is 1 when there is data in the input FIFO or data is being processed in the module core. As soon as the data is processed and the input FIFO is empty, the flag becomes 0</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OUT_NCLR</name>
                            <description>Flag of the presence of uncollected data, this flag is equal to 1 when data is processed in the core of the model or the output FIFO is not empty, at the end of processing and fetching all data from the output FIFO, the flag becomes 0</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IN_FIFO_EMPTY</name>
                            <description>Input FIFO is empty, this flag is set to 1 when there is no data in the input FIFO</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IN_FIFO_FULL</name>
                            <description>The input FIFO is full, this flag is set to 1, when the FIFO is completely full, the data being written when the flag is set is discarded, when trying to write, the IN_FIFO_OVR flag is set</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IN_FIFO_LVL</name>
                            <description>The input FIFO has more data than the specified amount, this flag is set to 1 when the amount of data stored in the FIFO is greater than IN_LVL_VAL (see control register CRD_CTRL)</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IN_FIFO_OVR</name>
                            <description>Input FIFO overflowed. This flag is set to 1 when an attempt is made to write data to a filled FIFO when the IN_FIFO_FULL flag is set. The data written at this moment is discarded, and this flag is set to 1. The flag is removed when a successful write to the FIFO, that is, when the next write to an unfilled FIFO.</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OUT_FIFO_EMPTY</name>
                            <description>The output FIFO is empty. This flag is set to 1 when the FIFO has no data.</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OUT_FIFO_FULL</name>
                            <description>The output FIFO is full. This flag is at 1 when the FIFO is full.</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OUT_FIFO_LVL</name>
                            <description>The output FIFO has more data than the specified amount, this flag is set to 1 when the amount of data stored in the FIFO is greater than OUT_LVL_VAL (see control register CRD_CTRL).</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OUT_FIFO_OVR</name>
                            <description>An attempt was made to read from an empty FIFO. This flag is set to 1 when trying to read data from an empty FIFO when the OUT_FIFO_EMPTY flag is set. The past data will be read from the FIFO, and the flag will be set to 1. The flag is removed upon successful reading from the FIFO, that is, during the next reading from a non-empty FIFO.</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTF</name>
                    <displayName>INTF</displayName>
                    <description>Interrupt flag register</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>IN_FIFO_EMPTY_IF</name>
                            <description>The input FIFO is empty, the flag reflects the state of IN_FIFO_EMPTY bit (see the CRS_STATUS status register). It is put and removed with the appearance and removal of IN_FIFO_EMPTY bit.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IN_FIFO_NLVL_IF</name>
                            <description>The input FIFO is filled no higher than the specified level, the flag reflects the inversion of the state of IN_FIFO_LVL bit (see the CRS_STATUS status register). Flag at 1 when IN_FIFO_LVL at 0 and vice versa.</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IN_FIFO_NFULL_IF</name>
                            <description>The input FIFO is not completely filled, the flag reflects the inverse state of IN_FIFO_FULL bit (see the CRS_STATUS status register). Flag at 1 when IN_FIFO_FULL at 0 and vice versa.</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IN_FIFO_OVR_IF</name>
                            <description>The input FIFO is overflowed, the flag is set when this situation occurs, when the IN_FIFO_OVR bit appears (see CRS_STATUS status register), the flag is cleared by writing 1 to this bit.</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OUT_FIFO_NEMPTY_IF</name>
                            <description>The output FIFO is not empty, the flag reflects the inverse of the OUT_FIFO_EMPTY bit state (see CRD_STATUS status register). Flag at 1 when OUT_FIFO_EMPTY at 0 and vice versa.</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OUT_FIFO_LVL_IF</name>
                            <description>The output FIFO is filled above the specified level, the flag reflects the state of the OUT_FIFO_LVL bit (see the status register CRD_STATUS), is set and removed with the appearance and removal of the OUT_FIFO_LVL bit.</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OUT_FIFO_FULL_IF</name>
                            <description>The output FIFO is full, the flag reflects the state of the OUT_FIFO_FULL bit (see the status register CRD_STATUS), is set and removed when the OUT_FIFO_FULL bit appears and clears.</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OUT_FIFO_OVR_IF</name>
                            <description>Read from an empty FIFO, the flag is set when this situation occurs, when the OUT_FIFO_OVR bit appears (see the CRD_STATUS status register), the flag is cleared by writing 1 to this bit</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PROC_CMPL_IF</name>
                            <description>Data processing is completed, the flag is set when this situation occurs, when the IN_PRGR bit is cleared (see the CRD_STATUS status register), the flag is cleared by writing 1 to this bit</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTE</name>
                    <displayName>INTE</displayName>
                    <description>Interrupt enable register</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>IN_FIFO_EMPTY_IE</name>
                            <description>The input FIFO is empty, the flag reflects the state of IN_FIFO_EMPTY bit (see the CRS_STATUS status register). It is put and removed with the appearance and removal of IN_FIFO_EMPTY bit.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IN_FIFO_NLVL_IE</name>
                            <description>The input FIFO is filled no higher than the specified level, the flag reflects the inversion of the state of IN_FIFO_LVL bit (see the CRS_STATUS status register). Flag at 1 when IN_FIFO_LVL at 0 and vice versa.</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IN_FIFO_NFULL_IE</name>
                            <description>The input FIFO is not completely filled, the flag reflects the inverse state of IN_FIFO_FULL bit (see the CRS_STATUS status register). Flag at 1 when IN_FIFO_FULL at 0 and vice versa.</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IN_FIFO_OVR_IE</name>
                            <description>The input FIFO is overflowed, the flag is set when this situation occurs, when the IN_FIFO_OVR bit appears (see CRS_STATUS status register), the flag is cleared by writing 1 to this bit.</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OUT_FIFO_NEMPTY_IE</name>
                            <description>The output FIFO is not empty, the flag reflects the inverse of the OUT_FIFO_EMPTY bit state (see CRD_STATUS status register). Flag at 1 when OUT_FIFO_EMPTY at 0 and vice versa.</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OUT_FIFO_LVL_IE</name>
                            <description>The output FIFO is filled above the specified level, the flag reflects the state of the OUT_FIFO_LVL bit (see the status register CRD_STATUS), is set and removed with the appearance and removal of the OUT_FIFO_LVL bit.</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OUT_FIFO_FULL_IE</name>
                            <description>The output FIFO is full, the flag reflects the state of the OUT_FIFO_FULL bit (see the status register CRD_STATUS), is set and removed when the OUT_FIFO_FULL bit appears and clears.</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OUT_FIFO_OVR_IE</name>
                            <description>Read from an empty FIFO, the flag is set when this situation occurs, when the OUT_FIFO_OVR bit appears (see the CRD_STATUS status register), the flag is cleared by writing 1 to this bit</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PROC_CMPL_IE</name>
                            <description>Data processing is completed, the flag is set when this situation occurs, when the IN_PRGR bit is cleared (see the CRD_STATUS status register), the flag is cleared by writing 1 to this bit</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IN_X</name>
                    <displayName>IN_X</displayName>
                    <description>Vector X coordinate recording register</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>IN_Y</name>
                    <displayName>IN_Y</displayName>
                    <description>Vector Y coordinate recording register</description>
                    <addressOffset>0x00000014</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>IN_A</name>
                    <displayName>IN_A</displayName>
                    <description>Register for writing the value of the angle alpha</description>
                    <addressOffset>0x00000018</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>IN_SEQ</name>
                    <displayName>IN_SEQ</displayName>
                    <description>Sequential write register</description>
                    <addressOffset>0x0000001C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>OUT_X</name>
                    <displayName>OUT_X</displayName>
                    <description>Register for reading the X coordinate of the result vector</description>
                    <addressOffset>0x00000020</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>OUT_Y</name>
                    <displayName>OUT_Y</displayName>
                    <description>Register for reading the Y coordinate of the result vector</description>
                    <addressOffset>0x00000024</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>OUT_A</name>
                    <displayName>OUT_A</displayName>
                    <description>alpha angle reading register</description>
                    <addressOffset>0x00000028</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>OUT_SEQ</name>
                    <displayName>OUT_SEQ</displayName>
                    <description>Sequential reading register</description>
                    <addressOffset>0x0000002C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>IN_ADDR</name>
                    <displayName>IN_ADDR</displayName>
                    <description>Register of record address selection</description>
                    <addressOffset>0x00000030</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>OUT_ADDR</name>
                    <displayName>OUT_ADDR</displayName>
                    <description>Register of read address selection</description>
                    <addressOffset>0x00000034</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
