ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/SVD/MDR1986VK01/MDR1986VK01.svd
            </registers>
        </peripheral>
        <!--MDR_SDIO-->
        <peripheral>
            <name>MDR_SDIO</name>
            <description>MDR_SDIO description</description>
            <groupName>MDR_SDIO</groupName>
            <baseAddress>0x400B5000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>POWER</name>
                    <displayName>POWER</displayName>
                    <description>POWER description</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PWRCTRL</name>
                            <description>PWRCTRL description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CLKCR</name>
                    <displayName>CLKCR</displayName>
                    <description>CLKCR description</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CLKDIV</name>
                            <description>CLKDIV description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>CLKEN</name>
                            <description>CLKEN description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PWRSAV</name>
                            <description>PWRSAV description</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BYPASS</name>
                            <description>BYPASS description</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WIDBUS</name>
                            <description>WIDBUS description</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>NEGEDGE</name>
                            <description>NEGEDGE description</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HWFC_EN</name>
                            <description>HWFC_EN description</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ARG</name>
                    <displayName>ARG</displayName>
                    <description>ARG description</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>CMD</name>
                    <displayName>CMD</displayName>
                    <description>CMD description</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CMDINDEX</name>
                            <description>CMDINDEX description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>WAITRESP</name>
                            <description>WAITRESP description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>WAITINT</name>
                            <description>WAITINT description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WAITPEND</name>
                            <description>WAITPEND description</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CPSMEN</name>
                            <description>CPSMEN description</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SDIOSUSPEND</name>
                            <description>SDIOSUSPEND description</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RESPCMD</name>
                    <displayName>RESPCMD</displayName>
                    <description>RESPCMD description</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>RESPCMD</name>
                            <description>RESPCMD description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RESP1</name>
                    <displayName>RESP1</displayName>
                    <description>RESP1 description</description>
                    <addressOffset>0x00000014</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RESP2</name>
                    <displayName>RESP2</displayName>
                    <description>RESP2 description</description>
                    <addressOffset>0x00000018</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RESP3</name>
                    <displayName>RESP3</displayName>
                    <description>RESP3 description</description>
                    <addressOffset>0x0000001C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RESP4</name>
                    <displayName>RESP4</displayName>
                    <description>RESP4 description</description>
                    <addressOffset>0x00000020</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>DTIMER</name>
                    <displayName>DTIMER</displayName>
                    <description>DTIMER description</description>
                    <addressOffset>0x00000024</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>DLEN</name>
                    <displayName>DLEN</displayName>
                    <description>DLEN description</description>
                    <addressOffset>0x00000028</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>DATALENGTH</name>
                            <description>DATALENGTH description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DCTRL</name>
                    <displayName>DCTRL</displayName>
                    <description>DCTRL description</description>
                    <addressOffset>0x0000002C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>DTEN</name>
                            <description>DTEN description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DTDIR</name>
                            <description>DTDIR description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DTMODE</name>
                            <description>DTMODE description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMAEN</name>
                            <description>DMAEN description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DBLOCKSIZE</name>
                            <description>DBLOCKSIZE description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>RWSTART</name>
                            <description>RWSTART description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RWSTOP</name>
                            <description>RWSTOP description</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RWMOD</name>
                            <description>RWMOD description</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SDIOEN</name>
                            <description>SDIOEN description</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DCOUNT</name>
                    <displayName>DCOUNT</displayName>
                    <description>DCOUNT description</description>
                    <addressOffset>0x00000030</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>DATACOUNT</name>
                            <description>DATACOUNT description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STA</name>
                    <displayName>STA</displayName>
                    <description>STA description</description>
                    <addressOffset>0x00000034</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CCRCFAIL</name>
                            <description>CCRCFAIL description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DCRCFAIL</name>
                            <description>DCRCFAIL description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTIMEOUT</name>
                            <description>CTIMEOUT description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DTIMEOUT</name>
                            <description>DTIMEOUT description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXUNDERR</name>
                            <description>TXUNDERR description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXOVERR</name>
                            <description>RXOVERR description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CMDREND</name>
                            <description>CMDREND description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CMDSENT</name>
                            <description>CMDSENT description</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DATAEND</name>
                            <description>DATAEND description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DBCKEND</name>
                            <description>DBCKEND description</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CMDACT</name>
                            <description>CMDACT description</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXACT</name>
                            <description>TXACT description</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXACT</name>
                            <description>RXACT description</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXFIFOHE</name>
                            <description>TXFIFOHE description</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXFIFOHF</name>
                            <description>RXFIFOHF description</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXFIFOF</name>
                            <description>TXFIFOF description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXFIFOF</name>
                            <description>RXFIFOF description</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXFIFOE</name>
                            <description>TXFIFOE description</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXFIFOE</name>
                            <description>RXFIFOE description</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXDAVL</name>
                            <description>TXDAVL description</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXDAVL</name>
                            <description>RXDAVL description</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SDIOIT</name>
                            <description>SDIOIT description</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICR</name>
                    <displayName>ICR</displayName>
                    <description>ICR description</description>
                    <addressOffset>0x00000038</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CCRCFAILC</name>
                            <description>CCRCFAILC description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DCRCFAILC</name>
                            <description>DCRCFAILC description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTIMEOUTC</name>
                            <description>CTIMEOUTC description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DTIMEOUTC</name>
                            <description>DTIMEOUTC description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXUNDERRC</name>
                            <description>TXUNDERRC description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXOVERRC</name>
                            <description>RXOVERRC description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CMDRENDC</name>
                            <description>CMDRENDC description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CMDSENTC</name>
                            <description>CMDSENTC description</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DATAENDC</name>
                            <description>DATAENDC description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DBCKENDC</name>
                            <description>DBCKENDC description</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SDIOITC</name>
                            <description>SDIOITC description</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
