ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/SVD/MDR1986VK01/MDR1986VK01.svd
                <register>
                    <name>MASK</name>
                    <displayName>MASK</displayName>
                    <description>MASK description</description>
                    <addressOffset>0x0000003C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CCRCFAILIE</name>
                            <description>CCRCFAILIE description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DCRCFAILIE</name>
                            <description>DCRCFAILIE description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTIMEOUTIE</name>
                            <description>CTIMEOUTIE description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DTIMEOUTIE</name>
                            <description>DTIMEOUTIE description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXUNDERRIE</name>
                            <description>TXUNDERRIE description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXOVERRIE</name>
                            <description>RXOVERRIE description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CMDRENDIE</name>
                            <description>CMDRENDIE description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CMDSENTIE</name>
                            <description>CMDSENTIE description</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DATAENDIE</name>
                            <description>DATAENDIE description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DBCKENDIE</name>
                            <description>DBCKENDIE description</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CMDACTIE</name>
                            <description>CMDACTIE description</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXACTIE</name>
                            <description>TXACTIE description</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXACTIE</name>
                            <description>RXACTIE description</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXFIFOHEIE</name>
                            <description>TXFIFOHEIE description</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXFIFOHFIE</name>
                            <description>RXFIFOHFIE description</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXFIFOFIE</name>
                            <description>TXFIFOFIE description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXFIFOFIE</name>
                            <description>RXFIFOFIE description</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXFIFOEIE</name>
                            <description>TXFIFOEIE description</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXFIFOEIE</name>
                            <description>RXFIFOEIE description</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXDAVLIE</name>
                            <description>TXDAVLIE description</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXDAVLIE</name>
                            <description>RXDAVLIE description</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SDIOITIE</name>
                            <description>SDIOITIE description</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FIFOCNT</name>
                    <displayName>FIFOCNT</displayName>
                    <description>FIFOCNT description</description>
                    <addressOffset>0x00000048</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>FIFOCOUNT</name>
                            <description>FIFOCOUNT description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>24</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FIFO</name>
                    <displayName>FIFO</displayName>
                    <description>FIFO description</description>
                    <addressOffset>0x00000080</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
