ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/SVD/MDR1986VK01/MDR1986VK01.svd
            </registers>
        </peripheral>
        <!--MDR_CRC-->
        <peripheral>
            <name>MDR_CRC</name>
            <description>MDR_CRC description</description>
            <groupName>MDR_CRC</groupName>
            <baseAddress>0x400B6000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>DR</name>
                    <displayName>DR</displayName>
                    <description>CRC Data register</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>IDR</name>
                    <displayName>IDR</displayName>
                    <description>CRC Independent data register</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x8</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>CR</name>
                    <displayName>CR</displayName>
                    <description>CRC Control register</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>RESET</name>
                            <description>reset bit</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>POLYSIZE</name>
                            <description>Polynomial size</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>REV_IN</name>
                            <description>Reverse input data</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>REV_OUT</name>
                            <description>Reverse output data</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INIT</name>
                    <displayName>INIT</displayName>
                    <description>Initial CRC value register</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>POL</name>
                    <displayName>POL</displayName>
                    <description>CRC polynomial register</description>
                    <addressOffset>0x00000014</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
            </registers>
        </peripheral>
        <!--GATE0-->
        <peripheral>
            <name>GATE0</name>
            <description>GATE0 description</description>
            <groupName>GATE</groupName>
            <baseAddress>0x21030000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>FIFO_OP_TO_SF</name>
                    <displayName>FIFO_OP_TO_SF</displayName>
                    <description>FIFO opened core -&gt; safe core data register</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>FIFO_SF_TO_OP</name>
                    <displayName>FIFO_SF_TO_OP</displayName>
                    <description>FIFO safe core -&gt; opened core data register</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>FIFO_LEVELS</name>
                    <displayName>FIFO_LEVELS</displayName>
                    <description>FIFO control levels register</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>FIFO_INT_MASK</name>
                    <displayName>FIFO_INT_MASK</displayName>
                    <description>FIFO interruptions mask register</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>FIFO_INT_SOURCE</name>
                    <displayName>FIFO_INT_SOURCE</displayName>
                    <description>FIFO interruption source register</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>REG00</name>
                    <displayName>REG00</displayName>
                    <description>In/out data register00  r/w</description>
                    <addressOffset>0x00000014</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>REG01</name>
                    <displayName>REG01</displayName>
                    <description>In/out data register01  r/w</description>
                    <addressOffset>0x00000018</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>REG02</name>
                    <displayName>REG02</displayName>
                    <description>In/out data register02  r/w</description>
                    <addressOffset>0x0000001C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>REG03</name>
                    <displayName>REG03</displayName>
                    <description>In/out data register03  r/w</description>
                    <addressOffset>0x00000020</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>REG04</name>
                    <displayName>REG04</displayName>
                    <description>In/out data register04  r/w</description>
                    <addressOffset>0x00000024</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>REG05</name>
                    <displayName>REG05</displayName>
                    <description>In/out data register05  r/w</description>
                    <addressOffset>0x00000028</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>REG06</name>
                    <displayName>REG06</displayName>
                    <description>In/out data register06  r/w</description>
                    <addressOffset>0x0000002C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>REG07</name>
                    <displayName>REG07</displayName>
                    <description>In/out data register07  r/w</description>
                    <addressOffset>0x00000030</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>REG08</name>
                    <displayName>REG08</displayName>
                    <description>In/out data register08  r/o</description>
                    <addressOffset>0x00000034</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>REG09</name>
                    <displayName>REG09</displayName>
                    <description>In/out data register09  r/o</description>
                    <addressOffset>0x00000038</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>REG10</name>
                    <displayName>REG10</displayName>
                    <description>In/out data register10  r/o</description>
                    <addressOffset>0x0000003C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>REG11</name>
                    <displayName>REG11</displayName>
                    <description>In/out data register11  r/o</description>
                    <addressOffset>0x00000040</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>REG12</name>
                    <displayName>REG12</displayName>
                    <description>In/out data register12  r/o</description>
                    <addressOffset>0x00000044</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>REG13</name>
                    <displayName>REG13</displayName>
                    <description>In/out data register13  r/o</description>
                    <addressOffset>0x00000048</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>REG14</name>
                    <displayName>REG14</displayName>
                    <description>In/out data register14  r/o</description>
                    <addressOffset>0x0000004C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>REG15</name>
                    <displayName>REG15</displayName>
                    <description>In/out data register15  r/o</description>
                    <addressOffset>0x00000050</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>REGS_BUSY</name>
                    <displayName>REGS_BUSY</displayName>
                    <description>Input data registers busyness indicator</description>
                    <addressOffset>0x00000054</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>REGS_INT_MASK</name>
                    <displayName>REGS_INT_MASK</displayName>
                    <description>Data registers interruptions mask register</description>
                    <addressOffset>0x00000058</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>REGS_INT_SOURCE</name>
                    <displayName>REGS_INT_SOURCE</displayName>
                    <description>Data registers interruption source register</description>
                    <addressOffset>0x0000005C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
            </registers>
        </peripheral>
        <!--GATE1-->
        <peripheral derivedFrom="GATE0">
            <name>GATE1</name>
            <description>GATE1 description</description>
            <baseAddress>0x21030080</baseAddress>
        </peripheral>
    </peripherals>
</device>

